[
  {
    "Dish Name": "Pistachio chicken",
    "Description": "Mild chicken in a creamy pistachio sauce",
    "Spice": "mild",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "30 mins",
    "Ingredients": "1) 600g chicken thighs, cut into chunks\n2) 100g Pistachios, blanched\n3) 1 medium onion, chopped finely\n4) 7cm piece ginger, roughly chopped\n5) 2-3 green chillies 6 garlic cloves\n6) ½ small bunch of fresh coriander leaves\n7) 200g yoghurt ½ tsp turmeric powder\n8) Salt to taste\n9) 2 tbsp ghee\n10) 2 cloves\n11) 15 black peppercorns\n12) 4 green cardamoms, cracked\n13) 1 bay leaf\n14) 2 inch cassia bark\n15) 1 tsp cumin seeds\n16) Fresh cream for garnish\n17) Fresh coriander to garnish</li>",
    "Instructions": "1) Boil enough water to cover the pistachios, add them and blanch for about 5 minutes.\n2) Drain and put them into cold water so they stay green.\n3) Squish them in your fingers to remove the skins. Discard the skin and place the pistachios in a bowl for later.\n4) Put the chicken in a large bowl and add yoghurt, turmeric powder, salt and mix well.\n5) Heat ghee and add cloves, black peppercorns, green cardamoms, bay leaf and cassia and sauté until fragrant. Add minced onion and and cook to soften for 5-10 minutes.\n6) Add ginger, green chillies, garlic and sauté until soft. Stir in the pistachios and stil for 2-3 minutes. Remove the pan from the heat and let it cool for a while.\n7) Remove the bay leaf and cassia bark. Pour into a large jug and add a handful of fresh coriander leaves and about 130 ml of water and with a stick blender and blitz to a fine purée.\n8) In the same pan heat a tbsp of ghee and add cumin seeds until they sizzle and put the cassia and bay back to the pan. Add the marinated chicken and sauté on high heat for 3-4 minutes.\n9) Pour in the blended pistachio paste with some salt and mix well. Cover the pan and cook for 25 minutes, stirring occasionally until cooked through.\n10) Transfer into a serving bowl. Garnish with fresh cream, coriander and slivers of pistachios.",
    "": ""
  },
  {
    "Dish Name": "Tangy Fried Okra",
    "Description": "Bhindi with Amchoor",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "15 mins",
    "Ingredients": "1) 500g okra\n2) 3 tbsp mustard oil\n3) 1 onion, finely sliced\n4) 2 tsp coriander seeds\n5) 1 dried red chilli/1tsp chilli flakes\n6) 1 tsp salt\n7) 1 tsp turmeric\n8) 1 tsp garam masala\n9) 2 tsp amchoor powder (dried mango powder)",
    "Instructions": "1) Wash and thoroughly dry the okra (kitchen roll is great for this).\n2) Remove the tops and slice the okra in half lengthways. Place the coriander seeds and red chilli into the pestle and mortar and pound until you have a coarse powder, then leave to one side.\n3) Heat the oil in a wok or non-stick pan on a medium heat, then stir in the sliced onions and cook until they just begin to brown.\n4) Add the okra and fry for about ten minutes, stirring now and then.\n5) Add the salt, turmeric along with the coriander and chilli mixture. Reduce the heat and leave the okra to cook for five more minutes (do not cover the pan).\n6) Once cooked, remove from the heat, sprinkle with garam masala and dust with the armchoor powder to serve.",
    "": ""
  },
  {
    "Dish Name": "Healthy Chicken Korma",
    "Description": "Chicken in Creamy Almond Sauce",
    "Spice": "mild",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "20 mins",
    "Ingredients": "1) 6-8 tbsp natural yoghurt\n2) 1 tsp turmeric\n3) 1 tsp cumin seeds, ground\n4) 1 tsp cinnamon powder\n5) 1 tsp coriander seeds, ground\n6) Pinch of saffron threads\n7) 3cm fresh ginger, grated\n8) 4 cloves garlic, crushed\n9) 4 skinless free range chicken breast cubed\n10) 1 tbsp rapeseed oil\n11) 1 onion very finely chopped or grated\n12) 2–3 tbsp ground almonds\n13) 2 tbsp ground coconut\n14) 1 tbsp flaked toasted almonds\n15) large pinch fresh coriander, chopped",
    "Instructions": "1) Grind your whole spices in a spice grinder.\n2) Place the yoghurt into a bowl with the turmeric, cumin, cinnamon, coriander, saffron, ginger and garlic and mix well to combine the flavours.\n3) Add the chicken pieces into the yoghurt mixture and coat all the chicken. Leave to marinade for as long as possible.\n4) Heat some oil in a pan and cook the onion until it softens and just starts turning golden (you don't want them too brown). If the onions catch on the bottom of the pan, just add a splash of water to help them cook down.\n5) Add the chicken and marinade to the pan and stir until the meat just starts to cook.\n6) Reduce the heat and place the lid on the pan and leave to cook for 5 minutes.\n7) Remove the lid and stir in the ground almonds and coconut. If it seems dry, add a little splash of hot water and allow the chicken to cook for a couple of minutes until the chicken is cooked through. Remove the pan from the heat.\n8) Toast some almond slivers in a dry pan until golden, remove and set to one side.\n9) When ready to serve, add some fresh coriander and the toasted almonds.",
    "": ""
  },
  {
    "Dish Name": "Brown Lentil Dhal",
    "Description": "Sabut Masoor di Dhal",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "20 mins",
    "Ingredients": "1) 200g brown lentils\n2) Approx. 1L of water",
    "Instructions": "1) Place the lentils in the pressure cooker with about 700ml of cold water and one tsp salt.\n2) Put the lid on the pan and secure it as instructed. Bring to the boil and allow the cooker to whistle three times.\n3) Reduce heat and leave it to simmer for 10 minutes. Remove from the heat and leave to cool - DO NOT REMOVE THE LID.\n4) In a frying pan heat the butter and add the onions and fry until lightly browned. Reduce the heat and add the tomatoes, ginger, chilli, turmeric and cook down so the tomatoes and onions melt, creating a thick masala paste. This will take about 10 minutes.\n5) Ensure the steam has been released from the pressure cooker and open the lid.\n6) Check the dhal is cooked by squeezing some lentils between your fingers. If they are still hard check the water level (add a little more if required) and re-place lid on the cooker and repeat as per step 2. Once the lentils are soft they are ready.\n7) Add the masala paste to the cooked dhal and cook together for a few minutes.\n8) Sprinkle in the garam masala and coriander to serve.",
    "": ""
  },
  {
    "Dish Name": "Thari Wala Chicken",
    "Description": "Healthy Chicken Curry",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "40 mins",
    "Ingredients": "1) 8 pieces of chicken (4 legs cut into thigh and drumsticks)",
    "Instructions": "1) Skin the chicken, removing any excess fat.\n2) Heat oil in a pan and add the onion and garlic. Fry on a high heat for a few minutes then reduce the heat and cook gently for about 20 minutes until they turn a lovely dark golden brown. If they stick to the bottom of the pan reduce the heat and add a dash of hot water as and when required.\n3) Once browned add the tinned tomatoes, ginger, salt, turmeric, coriander stalks and chopped chilli. Increase the heat to high.\n4) Let the onions and tomatoes melt together creating a thick aromatic masala paste. This will take about 5-10 minutes so be patient! Once the paste is shiny and thick add the chicken pieces and stir to coat.\n5) Turn the heat up and fry the chicken for 5 minutes.\n6) Reduce the heat to the lowest setting and put the lid on the pan. Leave to cook for 20 - 25 minutes until the chicken is cooked and the meat is starting to fall away from the bone.\n7) Once cooked, add enough boiling water to just cover the chicken and cook for another few minutes then remove from the heat.\n8) Stir in the garam masala, throw in the coriander and serve.",
    "": ""
  },
  {
    "Dish Name": "Achaari Bangun",
    "Description": "Aubergine and Potato Curry with Pickling Spices",
    "Spice": "hot",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "30 mins",
    "Ingredients": "1) 1 tsp fennel seeds\n2) 1 tsp mustard seeds\n3) 1 tsp fenugreek seeds\n4) 1 tsp nigella seeds (kalonji)\n5) ½ tsp cumin seeds\n6) ½ tsp chilli flakes",
    "Instructions": "1) In a heavy bottom pan, dry roast all the spices on a medium low heat until fragrant and nutty. Shake the pan so they don't burn. Remove from the heat and put into a bowl so they don't continue to cook.\n2) Allow the spices to cool completely then in a spice grinder blitz to a fine powder.",
    "": ""
  },
  {
    "Dish Name": "Aloo Bangun",
    "Description": "Potato Aubergine Curry",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "40 mins",
    "Ingredients": "1) 2 aubergines, cut into 3cm lengths\n2) 2 potatoes, peeled and cut into 3cm lengths\n3) 2 tbsp mustard oil\n4) 1 tsp mustard seeds\n5) 1 tsp cumin seeds\n6) 1 onion, finely sliced\n7) 200g/½ tin tomatoes\n8) 1 tbsp ginger, grated\n9) 1 tsp salt\n10) 1 tsp turmeric\n11) 1 chilli, finely chopped\n12) 1 tsp garam masala\n13) Handful fresh coriander, chopped",
    "Instructions": "1) Heat the oil in a wok or karahi and add 1 tsb of mustard seeds. Once sizzling, add 1 tsp cumin seeds and fry until they become fragrant.\n2) Then add 1 sliced onion and continue to cook until soft and lightly browned. .\n3) Reduce the heat a little and add 200 g tomatoes, 1 tsp salt, 1 tsp turmeric, 1 finely chopped chilli and 1 tbsp grated ginger. .\n4) Cook until the onions and tomatoes melt together to create a thick, aromatic masala paste (5-10 minutes). .\n5) Add 2 cubed potatoes and stir to coat with the sauce. Reduce the heat cover the pan with the lid and leave to cook for 5 minutes. Add a little drop of water if required. .\n6) Stir in the 2 cubed aubergines and coat them with the masala. .\n7) Replace lid and leave to cook for 25-30 minutes stirring occasionally, until cooked through. .\n8) Once soft and cooked through sprinkle the curry with garam masala and fresh coriander before serving.",
    "": ""
  },
  {
    "Dish Name": "Bombay Aloo",
    "Description": "Masala Potatoes",
    "Spice": "hot",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "30 mins",
    "Ingredients": "1) 1 tbsp vegetable oil\n2) 1 tsp mustard seeds\n3) 5 curry leaves\n4) 1 onion, sliced\n5) 2 green chillies, finely chopped\n6) 1 tsp cumin seeds\n7) 1 tsp coriander seeds\n8) ½ tsp red chilli powder (optional)\n9) ½ tsp turmeric\n10) 1 tsp salt\n11) 2 potatoes, cut into chunks\n12) 1 tsp garam masala\n13) Handful fresh coriander, finely chopped",
    "Instructions": "1) Heat the oil in a pan and add the mustard seeds and curry leaves.\n2) Once the mustard seeds splutter stir in the onions and cook until they turn a light golden brown colour.\n3) Place the coriander and cumin seeds into a pestle and mortar and pound to a powder. Add this, the turmeric, green chillies and chilli powder to the onions.\n4) After a minute the spices will become fragrant, stir in the potatoes and salt then cook for about 5 minutes.\n5) Reduce the heat and stir in a splash of water. Place the lid on the pan and leave to steam for about 15-20 minutes until the potatoes are soft.\n6) Remove from the heat and finish with one teaspoon garam masala and a handful of fresh coriander.",
    "": ""
  },
  {
    "Dish Name": "Coriander Fish",
    "Description": "Thania Machchi",
    "Spice": "medium",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "15 mins",
    "Ingredients": "1) 4-6 pieces of white fish, washed and dried\n2) 1 tbsp turmeric powder\n3) 1 tsp salt\n4) 2 tbsp oil",
    "Instructions": "1) Sprinkle the fish with salt and turmeric powder and leave to marinade for 15 minutes.",
    "": ""
  },
  {
    "Dish Name": "Hariyali Chicken",
    "Description": "Green Chicken Tikka",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "20 mins",
    "Ingredients": "1) 6 chicken thigh fillets, trimmed and skinned",
    "Instructions": "1) Clean, wash and pat dry the chicken pieces.\n2) Put the cumin seeds into a pestle and mortar and roughly crush the seeds.\n3) Place the mint, coriander, ginger, garlic, chillies, lemon juice, salt and oil into a blender and blitz to a paste.\n4) Empty this paste into a bowl and mix in the yoghurt and crushed cumin seeds.\n5) Combine the chicken and the marinade and let it sit for at least 30 minutes but overnight is better.\n6) Cook in the oven at 180°C for 25 minutes or on the barbecue for about 10-15 minutes until cooked through.",
    "": ""
  },
  {
    "Dish Name": "Jeera Aloo",
    "Description": "Cumin Potatoes",
    "Spice": "medium",
    "Prep Time": "Prep 15 mins",
    "Cook Time": "10 mins",
    "Ingredients": "1) 4 potatoes, boiled and cubed\n2) 2 tbsp vegetable oil\n3) 1 tbsp coriander seeds\n4) 2 tsp cumin seeds\n5) 2 green chillies, slit lengthways\n6) 3cm fresh ginger, sliced very thinly\n7) 1 tsp red chilli powder\n8) ¼ tsp turmeric powder\n9) salt to taste\n10) 2 tsp mango powder (amchoor powder)\n11) handful of coriander leaves, chopped",
    "Instructions": "1) Boil the potatoes gently with the skin on for about 10 minutes. Once cooled peel and cut them into 4cm cubes and set to one side.\n2) Dry roast the coriander seeds and 1 tsp of cumin seeds until fragrant then remove from the heat and cool before crushing.\n3) Heat oil and add remaining cumin seeds once sizzling and fragrant, stir in the sliced green chillies and sliced ginger. Saute for a few seconds, reduce the heat and then add the roasted spice powder, turmeric powder, chilli powder and salt.\n4) Add the boiled and cubed potatoes. Mix well so that it is well coated with the seasoning.\n5) Cook on a gentle heat for 10 minutes stirring occasionally - you don't want them to turn into mash.\n6) Add the amchoor powder and garnish with coriander leaves.",
    "": ""
  },
  {
    "Dish Name": "Cabbage Thoran",
    "Description": "Cabbage Curry",
    "Spice": "hot",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "20 mins",
    "Ingredients": "1) 3 tbsp coconut oil\n2) 2 tsp black mustard seeds\n3) 2 tbsp chopped, fresh curry leaves\n4) 1 tsp cumin seeds\n5) 2 dried Kashmiri chillies, each broken into smaller pieces\n6) 5cm ginger piece, finely grated\n7) ½ tsp turmeric\n8) 1 tsp salt\n9) ½ tsp ground black pepper\n10) 250g cabbage, shredded\n11) 2 fresh green chillies, sliced\n12) 100g fresh coconut, grated",
    "Instructions": "1) Heat the oil in a large saucepan or karahi. When it is hot, add the mustard seeds followed by the curry leaves, cumin seeds and dried chillies.\n2) Stir for about 30 seconds, then add the grated ginger, turmeric, salt and black pepper and fry for 30 seconds.\n3) Stir in the cabbage and cook over a medium heat for 5-7 minutes. You may need to add a splash of water.\n4) Once the cabbage is tender, stir in the green chillies and coconut. Heat through for a few minutes and serve.\n5) Perfect with some fresh boiled rice.",
    "": ""
  },
  {
    "Dish Name": "Keralan Fish Curry",
    "Description": "South Indian fish curry",
    "Spice": "hot",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "15 mins",
    "Ingredients": "1) 750g firm white fish cut into chunks\n2) ½ tsp turmeric\n3) ½ tsp salt\n4) 1 tbsp Coconut oil\n5) 1 tsp mustard seeds\n6) 20 curry leaves\n7) 5 shallots, finely sliced\n8) 4 garlic cloves, finely sliced\n9) 3cm piece of ginger, finely sliced\n10) 1-2 green chilli, finely sliced\n11) 1 tbsp Kashmiri chilli powder (this can be reduced to suit your taste, if unsure use 1tsp)\n12) ½ tsp turmeric\n13) 4 tomatoes, chopped\n14) 400ml tin coconut milk\n15) Handful coriander, chopped",
    "Instructions": "1) Coat the fish in salt and turmeric\n2) Heat a tbsp of coconut oil in a shallow large based pan.\n3) Add the mustard seeds with the curry leaves till the seeds start to pop.\n4) Add the sliced shallots, garlic, ginger and chilli, and cook on a medium heat for 5 minutes, till softened.\n5) Mix together the chilli powder and turmeric with a splash of water to make a paste (this stops the turmeric burning), and then stir into the pan.\n6) Add the coconut milk and heat through. When you are ready to serve add the chopped tomatoes and stir in the fish. Cook on a gentle heat for about 5 minutes until the fish is cooked through.\n7) Check the seasoning then sprinkled with fresh chopped coriander and some with fragrant basmati rice.",
    "": ""
  },
  {
    "Dish Name": "Masala Machchi",
    "Description": "Spiced Salmon",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "10 mins",
    "Ingredients": "1) 2 pieces of salmon",
    "Instructions": "1) Heat oven to 180°C.",
    "": ""
  },
  {
    "Dish Name": "Mixed Vegetable Sabjee",
    "Description": "Mixed Vegetable Curry",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "20 mins",
    "Ingredients": "1) 1 potato, diced\n2) 1 pepper, diced\n3) 5 mushrooms, quatered\n4) 1 carrot, diced\n5) 50g frozen peas\n6) 2 tbsp mustard oil\n7) 1 tsp mustard seeds\n8) 1 tsp cumin seeds\n9) 1 onion, finely diced\n10) 200g tomatoes\n11) 2 garlic cloves, finely chopped\n12) 1 tbsp ginger, grated\n13) 1 tsp salt\n14) 1 tsp turmeric\n15) 1 tsp dried fenugreek leaves\n16) 1 chilli, finely chopped\n17) 1 tsp garam masala\n18) handful of fresh coriander, chopped",
    "Instructions": "1) Heat the oil in a karahi or wok and add the mustard seeds, when sizzling add the cumin seeds until fragrant.\n2) Add the onions and garlic then fry until soft and lightly browned (about 10 minutes)\n3) Reduce the heat and add the tomatoes, ginger, salt, turmeric, chilli and fenugreek. Continue to cook so the onions and tomatoes melt together to create a thick, aromatic masala paste.\n4) Add the chopped vegetables and stir to coat with the sauce.\n5) Reduce the heat cover the pan with the lid and leave to cook for about 10-20 minutes, stirring occasionally until the vegetables are cooked through.\n6) Once cooked sprinkle with garam masala and fresh coriander before serving.",
    "": ""
  },
  {
    "Dish Name": "Simply Spiced Seasonal Vegetables",
    "Description": "Tarkari Handi",
    "Spice": "medium",
    "Prep Time": "Prep 20 mins",
    "Cook Time": "10 mins",
    "Ingredients": "1) 1 tbsp oil\n2) 1 tsp cumin seeds\n3) 4 mushrooms, sliced\n4) 5 florets cauliflower\n5) 5 florets broccoli\n6) 6 baby corn, chopped into 3 pieces\n7) 5 asparagus, chopped into 3 pieces\n8) 10 green beans, chopped into 3 pieces\n9) 1 tsp butter\n10) handful spinach\n11) salt to taste\n12) pinch of crushed black pepper\n13) juice half a lemon",
    "Instructions": "1) Heat water in a pan and blanch the cauliflower, broccoli, baby corn, asparagus and green beans for a minute or so just to soften. Remove and run under cold water.\n2) Heat oil in a frying pan and add cumin seeds.\n3) Once fragrant add the mushrooms and saute for just a minute.\n4) Add the remaining vegetables except the spinach.\n5) Toss the vegetables to heat thoroughly for a few minutes.\n6) Add the butter then add the spinach. Toss all the vegetables together.\n7) Add a little salt and crushed black pepper.\n8) Squeeze in a little lemon juice and remove from the heat, check the seasoning and serve.",
    "": ""
  },
  {
    "Dish Name": "Aloo Gobi",
    "Description": "Potato Cauliflower Vegetable Curry",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "30 mins",
    "Ingredients": "1) 1 small cauliflower\n2) 2 potatoes, peeled cut into 4cm cubes\n3) 2 tbsp mustard oil\n4) 1 tsp mustard seeds\n5) 1 tsp cumin seeds\n6) 1 onion, finely chopped\n7) 2 cloves garlic, finely chopped\n8) 200g/½ tin tomatoes\n9) 1 tbsp ginger, grated\n10) 1 tsp salt\n11) 1 tsp turmeric\n12) 1 chilli, finely chopped\n13) 1 tsp dried fenugreek\n14) 1 tsp garam masala\n15) Handful chopped fresh coriander",
    "Instructions": "1) Prepare your cauliflower by cutting into florets, wash and drain. Ensure it's thoroughly dry before cooking.\n2) Heat the oil in a karahi and add the mustard seeds. Once sizzling add the cumin seeds.\n3) Add the onions and garlic then fry until soft and lightly browned.\n4) Once browned reduce the heat a little and add the tomatoes, ginger, salt, turmeric, chilli and dried fenugreek leaves.\n5) Continue to cook so the onions and tomatoes melt together to create a thick, aromatic masala paste.\n6) Add the potatoes and stir to coat with the sauce.\n7) Reduce the heat, cover the pan with the lid and leave to cook for 10 minutes, stirring occasionally.\n8) Add the cauliflower and stir into the sauce to coat. Replace lid and leave to cook for a further 25-30 minutes until cooked.\n9) Turn the vegetables occasionally but do not stir too vigorously as you don't want the cauliflower or potato to turn mushy. Once cooked sprinkle with garam masala and fresh coriander before serving.",
    "": ""
  },
  {
    "Dish Name": "Ajwainy Monkfish",
    "Description": "Fish in a carom spiced yoghurt",
    "Spice": "medium",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "10 mins",
    "Ingredients": "1) 500g monkfish, in thick chunks",
    "Instructions": "1) Put the ginger and garlic into a pestle and mortar and crush them to a paste.\n2) Mix this and all the remaining ingredients for the first marinade in a large bowl and add the pieces of monkfish. Leave this for half an hour while you prepare the second marinade.",
    "": ""
  },
  {
    "Dish Name": "Aloo Muttar",
    "Description": "Pea and Potato Curry",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "20 mins",
    "Ingredients": "1) 1 tbsp oil for cooking\n2) 1 onion, finely chopped\n3) 3 garlic cloves, chopped\n4) 3cm piece of ginger, grated\n5) 250g tinned plum tomatoes\n6) 1 green chilli, finely chopped\n7) 1 tsp salt\n8) 1 tsp fenugreek powder (methi)\n9) 1 tsp turmeric\n10) 1 tsp chilli powder\n11) 1 or 2 potatoes, peeled and chopped into 3cm cubes\n12) 200g frozen peas\n13) 1 tsp garam masala\n14) Handful of fresh coriander, chopped",
    "Instructions": "1) Heat oil and add onion and after a few minutes stir in the garlic. Cook for about 10 minutes until the onions are soft and turning golden.\n2) When the onions are cooked add the tomatoes (which you can whizz up before hand), grated ginger, salt, turmeric, fenugreek and chilli.\n3) Stir together and cook the sauce until the tomatoes and onion melt together creating a thick masala paste.\n4) Once it is thick and shiny add the pototes. Stir to coat them in the sauce then put the lid on the pan and reduce the heat. Leave to cook for 5-10 minutes before adding the frozen peas.\n5) Leave to cook for another 10 minutes until the potatoes are soft. (Note: if your potatoes stick just add a splash of water. Don't stir too much as you dont want the potatoes to mash).\n6) Pour in enough hot water to get the consistency you want. Sprinkle with garam masala and fresh coriander and serve with roti or rice.",
    "": ""
  },
  {
    "Dish Name": "Aloo Tama Bodi",
    "Description": "Black eyed bean and bamboo shoot stew",
    "Spice": "mild",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "20 mins",
    "Ingredients": "1) 2 tbsp ghee or oil\n2) 1 onion, finely chopped\n3) 2 garlic cloves, minced\n4) 5cm piece of ginger, grated\n5) 1 tsp coriander seeds, crushed\n6) 1 green chilli (optional)\n7) ½ tsp red chilli powder\n8) ½ tsp turmeric\n9) 200g red lentils, washed\n10) 700ml water\n11) 1 tsp salt",
    "Instructions": "1) Heat the ghee or oil in a large frying pan and cook the onions until translucent but not brown.\n2) Turn the heat to low and add in the garlic, ginger, chopped chilli (if using) crushed coriander seeds, red chilli powder and turmeric. Stir to combine for about 3 minutes or so.\n3) Add the red lentils and mix with the onion mixture.\n4) Pour thd water in and bring it to a boil, add the salt and reduce heat to a simmer for about 15 minutes or until the lentils are tender.\n5) Remove from the heat and stir in the fresh coriander.",
    "": ""
  },
  {
    "Dish Name": "Amchoor Stuffed Bangun",
    "Description": "Spice Stuffed Baby Aubergines",
    "Spice": "medium",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "25 mins",
    "Ingredients": "1) 1 tsp coriander seeds, crushed\n2) ½ tsp cumin seeds crushed\n3) ½ tsp turmeric\n4) ½ tsp chilli powder\n5) 1 tsp mango powder (amchoor)\n6) ½ tsp salt\n7) 1 tsp sugar\n8) 8 baby aubergine\n9) 3 tbsp mustard oil",
    "Instructions": "1) Mix all the spices & salt together in a bowl.\n2) Slit the aubergines with a cross.\n3) Heat oil in a heavy based pan with a lid.\n4) Stuff the spice mix into the inside flesh of the auberines.\n5) Rub the outside of the aubergines with any remaining spice mix.\n6) Place them in the pan and cover the pan. Leave them to cook on a gentle heat.\n7) Turn over using some tongs after about 10 minutes. Turn again after another 10 minutes. Cook them for about 25-30 mins until they are soft and tender.",
    "": ""
  },
  {
    "Dish Name": "Anda di Purjee (Bhurji)",
    "Description": "Indian Scrambled Eggs",
    "Spice": "mild",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "10 mins",
    "Ingredients": "1) 2 tsp butter\n2) 8 large free range eggs\n3) 3 spring onions, sliced including green bits\n4) 3 mushrooms, diced\n5) 1 tomato, chopped\n6) 2 tsp garam masala\n7) 1 or 2 chillis chopped\n8) ½ tsp chilli powder\n9) 1 tsp salt\n10) Handful of fresh coriander, chopped",
    "Instructions": "1) Break the eggs into a bowl and whisk.\n2) Heat butter in a frying pan.\n3) Add the sliced onions and fry to soften.\n4) Add the mushrooms and tomatoes (and other veg) and fry for a few minutes to cook through.\n5) Add the garam masala, chopped chilli, chilli powder, salt and stir for a second then add eggs and stir to scramble.\n6) Remove from heat and add coriander.",
    "": ""
  },
  {
    "Dish Name": "Asparagus and Pea Soup with Parsnip Crisps",
    "Description": "Healthy asparagus and pea soup",
    "Spice": "none",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "30 mins",
    "Ingredients": "1) 1 tbsp butter\n2) 2 cloves garlic, finely chopped\n3) 1 onion, chopped\n4) 1 tbsp plain flour\n5) 340g asparagus\n6) 250g peas\n7) pinch cracked black pepper, or to taste\n8) Salt to taste",
    "Instructions": "1) Heat butter in a pan and add the garlic. Cook to soften then stir in the chopped onion.\n2) Stir and leave to cook for 2 or 3 minutes.\n3) Stir in flour and roast for a minute or so to lose the rawness.\n4) Add 500ml of water and stir ensuring there are no lumps.\n5) Add the asparagus, peas, salt and pepper and bring to the boil\n6) Leave the pan to simmer until asparagus has cooked (about 15-20 minutes).\n7) Pour the soup into a blender and blitz until smooth.\n8) Pour through a strainer and return to the heat for a few minutes, check the seasoning then remove from the heat.",
    "": ""
  },
  {
    "Dish Name": "Asparagus with Indian Spices",
    "Description": "15 mins",
    "Spice": "mild",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "10 mins",
    "Ingredients": "1) 2 garlic cloves\n2) 3cm piece ginger\n3) 500g Asparagus, chopped\n4) 3 tsp rapeseed oil\n5) 1 tsp cumin seeds\n6) ½ tsp fennel seeds\n7) 1 onion, sliced\n8) 1 green chillies, finely chopped\n9) 1 tsp Kashmiri chilli powder\n10) ½ tsp amchoor powder (dried mango powder)\n11) 3 tomatoes, chopped finely\n12) Salt to taste",
    "Instructions": "1) Crush the ginger and garlic in a pestle and mortar to a paste.\n2) Heat the oil in pan and on a medium heat add the cumin and fennel seeds.\n3) Once sizzling and fragrant add sliced onions with the chopped green chilies and crushed ginger and garlic. Cook for about 5 minutes.\n4) Add the chopped asparagus and sprinkle in the salt, red chili powder and amchoor.\n5) Add chopped tomatoes and cook for about 2-3 minutes.",
    "": ""
  },
  {
    "Dish Name": "Athrak Soup",
    "Description": "Ginger soup",
    "Spice": "medium",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "15 mins",
    "Ingredients": "1) 5cm piece of fresh ginger, roughly chopped\n2) 1 fresh chilli, chopped\n3) 3 cloves of garlic\n4) 200g of tinned tomatoes\n5) 200ml water",
    "Instructions": "1) Put all the ginger, chilli, garlic, into a blender and blend to a paste. Then add the tomatoes and water.",
    "": ""
  },
  {
    "Dish Name": "Avocado Salsa",
    "Description": "15 mins",
    "Spice": "hot",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "5 mins",
    "Ingredients": "1) 1 ripe avocado\n2) 1 red onion\n3) 1 chilli, finely chopped\n4) Juice from 1 lemon\n5) Small handful of fresh coriander, chopped",
    "Instructions": "1) Cut the avocado and onion into very small dices and place in a bowl.\n2) Add chilli, lemon juice and coriander and stir together.\n3) Leave for a few minutes and serve.",
    "": ""
  },
  {
    "Dish Name": "Black Chana Masala",
    "Description": "Kala Chana",
    "Spice": "medium",
    "Prep Time": "Prep 20 mins",
    "Cook Time": "40 mins",
    "Ingredients": "1) 175g dried black chickpeas (400g tin cooked chickpeas)\n2) 2 tbsp oil/ghee\n3) 1 tsp cumin seeds\n4) 1 large onion, finely minced\n5) 5cm piece ginger, minced\n6) 4 garlic cloves, minced\n7) 1–2 green chilis, minced\n8) 200g chopped tomatoes tinned/fresh\n9) 1 tsp salt\n10) 1 tsp chilli powder\n11) ½ tsp turmeric\n12) 1 tsp kasoori methi (fenugreek leaves)\n13) 1 tsp coriander powder\n14) 1 tsp garam masala\n15) Handful coriander chopped\n16) Juice of 1 lemon",
    "Instructions": "1) Wash the dried black chickpeas and soak in 1.5L of water overnight or in boiling water for a minimum 6 hours.\n2) Drain the chickpeas and rinse in fresh water.\n3) Heat oil in a pressure cooker and add cumin seeds. When they become aromatic add the finely chopped onions.\n4) Saute until they are golden brown then add garlic and stir for a minute or two.\n5) Pour in the tomatoes then add in the ginger and chillies. Mix together until the tomatoes start to break down and the masala thickens a little.\n6) Stir in the salt, chilli powder, turmeric, kasoori methi, coriander powder and mix well.\n7) Once the tomatoes have broken down a little, the spices and onions have melted together to create a thick paste add the black chickpeas and 750ml water.\n8) Put the lid on the pressure cooker and cook under high pressure for 30 minutes. If you are doing this on the stove top in a regular pan this will take about 2 hours to cook.\n9) After 30 minutes, let the pressure release before opening. Check the chana is cooked and tender – these do stay a little harder than white chickpeas.\n10) Bring to a simmer and if you want more of a gravy you can add water and let it simmer for a while.\n11) Once you are happy with the consistency add the garam masala and fresh coriander. I like to squeeze in some lemon juice too before serving.",
    "": ""
  },
  {
    "Dish Name": "Black Lentil and Split Chickpea Dhal",
    "Description": "Mahaar Chole di Dhal",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "40 mins",
    "Ingredients": "1) 100g split chickpeas (chana)\n2) 100g urid beans, washed and checked for stones\n3) 1L water\n4) 1 tsp salt",
    "Instructions": "1) Put the lentils in the pressure cooker and add 1L of cold water.\n2) Add 1 tsp of salt put the lid on the pan and bring to the boil. Let the pan come to temperature and whistle once, then reduce the heat and leave to simmer for 30 minutes. After this time remove from the heat and leave the pan to cool - DO NOT REMOVE THE LID.",
    "": ""
  },
  {
    "Dish Name": "Brown Masala Sauce",
    "Description": "Daag",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "40 mins",
    "Ingredients": "1) 2 tbsp of oil\n2) 4 onions, finely diced\n3) 6 cloves of garlic, finely chopped\n4) 800g plum tomatoes\n5) 8cm piece of fresh ginger, grated\n6) salt to taste\n7) 1½ tsp turmeric\n8) Handful of coriander stalks, finely chopped\n9) 3 fresh green chillies, finely chopped\n10) ½ tsp chilli powder\n11) 2 tsp of garam masala\n12) Handful of coriander leaves, chopped",
    "Instructions": "1) Heat oil in a pan and add the onion. Fry on a high heat for a few minutes then reduce the heat and cook gently.\n2) Add the finely chopped garlic and continue to cook gently for at least 30 minutes until the onions turn a really dark golden brown.\n3) Once brown and caramelised add the tomatoes, ginger, salt, turmeric, coriander stalks and chopped chillies and chilli powder.\n4) Let the onions, tomatoes and spices melt together creating a thick aromatic masala paste. This will take about 5-10 minutes so be patient!\n5) This masala can then be used for your dish or you can cool it down and freeze it in tubs. Just defrost as and when needed.",
    "": ""
  },
  {
    "Dish Name": "Caribbean Chicken Curry Stew",
    "Description": "Chicken Stew with Burnt Sugar",
    "Spice": "hot",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "30 mins",
    "Ingredients": "1) 1 whole chicken or 8 pieces of chicken on the bone",
    "Instructions": "1) Prep your chicken by cutting it into thigh, drumsticks, wings and breasts into pieces leaving the skin on.\n2) Mince the ginger, garlic, salt, black pepper, green part of the spring onion, parsley, coriander and scotch bonnet (if using) but you can opt for a milder chilli if you prefer.\n3) Marinade your chicken with the skin on for approx. 3 hours\n4) Heat a pan with the oil and add the sugar. Let it melt until it starts to bubble and goes dark in colour.\n5) It will turn frothy and look almost burnt, then stir in the curry powder.\n6) Once sizzling and aromatic place the marinated chicken into the pan to brown. You may have to do this in batches. Let it darken and crisp.\n7) Pour in the water or stock to cover the chicken and add a bay leaf, 2 sprigs of thyme a whole scotch bonnet and bring to the boil.\n8) Reduce to a simmer and leave to cook for 30 minutes.\n9) Stir in a shot of rum and simmer for another few minutes.\n10) The chicken should be fragrant and falling away from the bone.\n11) Slice the onion whites and sprinkle over the chicken - serve with some rice and peas.",
    "": ""
  },
  {
    "Dish Name": "Cauliflower Shorba",
    "Description": "Cauliflower Soup",
    "Spice": "mild",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "30 mins",
    "Ingredients": "1) 2 tbsp oil\n2) 1 bay leaf\n3) 6 cloves of garlic, sliced\n4) 1 green chilli\n5) 1 tsp salt\n6) 1 small cauliflower, chopped\n7) 750ml water\n8) 1 tsp cumin, roasted and roughly crushed",
    "Instructions": "1) Heat oil and add a bay leaf. Stir in the garlic and sauté until brown.\n2) Roughly chop the chilli and add to the pan.\n3) Add the chopped cauliflower and salt then cover with the water and bring to the boil. (You could use a stock.)\n4) Leave to simmer for about 20-30 minutes until the cauliflower is soft.\n5) Remove the bayleaf and blitz the soup in a liquidiser.\n6) Return to the stove and simmer for 5 minutes.\n7) Serve in small bowls topped with a sprinkling of roasted cumin seeds.",
    "": ""
  },
  {
    "Dish Name": "Chana Masala",
    "Description": "Tea-Infused Chickpea Curry",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "30 mins",
    "Ingredients": "1) 300g dried chickpeas (or 400g tin of cooked)\n2) 1 black tea bag\n3) 4cm piece ginger\n4) 2 green chillies\n5) 2 medium tomatoes\n6) 1 tbsp rapeseed oil\n7) 2 medium onions, thinly sliced\n8) 3 cloves of garlic, sliced\n9) 1 tsp Kashmiri chilli powder\n10) 1 tsp coriander powder\n11) 2 tsp cumin seeds\n12) 2 tsp pomegranate powder\n13) ½ tsp black salt\n14) salt to taste\n15) ½ tsp garam masala\n16) 1 tbsp lemon juice\n17) Fresh coriander, roughly chopped for garnish\n18) 1 tsp chaat masala",
    "Instructions": "1) Soak the dried chickpeas in about 1.5L of water overnight.\n2) Drain and place in a large saucepan with fresh water. Add the tea bag and bring to a boil. Reduce the heat and leave them to simmer for 1½ hours until the chickpeas are tender.\n3) Drain, discard the tea bag but keep the cooking liquid.\n4) Mash a few of the chickpeas with a potato masher.",
    "": ""
  },
  {
    "Dish Name": "Chapli Kebabs",
    "Description": "Tangy Beef Patties",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "10 mins",
    "Ingredients": "1) 500g ground beef\n2) 4 tbsp whole wheat flour\n3) 1 medium onion, finely chopped\n4) 1 tsp chilli powder\n5) 1 tsp cumin seeds\n6) 1 tsp garam masala\n7) 1 tsp salt\n8) Handful fresh coriander, chopped\n9) 2 green chillies, finely chopped\n10) 1 tbsp coriander seeds, crushed\n11) 1 tsp anardana (pomegranate seeds)\n12) 2 medium tomatoes,chopped\n13) Oil for frying",
    "Instructions": "1) Place the minced beef into a bowl.\n2) Crush the coriander, cumin and anardana seeds in a pestle and mortar or in a spice grinder and add to the bowl.\n3) Sprinkle in the flour and add the chopped onions, chopped chillies, tomatoes, coriander, garam masala, salt and chilli powder.\n4) Mix ingredient to combine all the flavours and form the mixture into flat patties about 1cm thick.\n5) Heat the oil in a pan and shallow fry them for about a minute then turn them over. Once cooked through place on some kitchen roll and serve with fresh naan, a red onion salad and yoghurt.",
    "": ""
  },
  {
    "Dish Name": "Chicken Balti",
    "Description": "Chicken Balti",
    "Spice": "hot",
    "Prep Time": "Prep 20 mins",
    "Cook Time": "40 mins",
    "Ingredients": "1) 3cm ginger\n2) 6 garlic cloves\n3) 2 tomatoes, quartered\n4) 1½ tsp garam masala\n5) 1½ tsp cumin seeds, crushed\n6) 1 tbsp coriander seeds, crushed\n7) 1 tsp turmeric\n8) 1 tsp Kashmiri chilli powder\n9) 1 tbsp full-fat Greek yogurt\n10) Salt, to taste\n11) 2 tbsp rapeseed oil\n12) 1 tsp brown mustard seeds\n13) 1 bay leaf\n14) 1 onion, finely chopped\n15) 6–10 whole green chillies, (reduce if this is too many for you)\n16) 500g boneless chicken thigh fillets, cut into bite-size chunks\n17) Black peppercorns, freshly ground\n18) 1 tbsp lemon juice, or to taste\n19) Large handful of finely chopped, fresh coriander leaves",
    "Instructions": "1) Blend together the ginger and garlic in a pestle and mortar or blender and set to one side.\n2) Grind the cumin and coriander seeds and set to one side.\n3) Blend the tomatoes to a paste and stir in the ground spices, garam masala, turmeric, Kashmiri chilli powder, yoghurt and salt.\n4) Heat the oil in a non-stick saucepan (or karahi if you have one) and add the mustard seeds.\n5) Once the mustard seeds pop, add the bay leaf and chopped onion.\n6) Stir and cook on a medium heat. After about 15 minutes add the minced ginger and garlic with the green chillies for at least 20-30 minutes until the onions are well browned. If the onions catch, add a splash of water and continue to cook the onions.\n7) Stir in the blended tomatoes, spices and yoghurt mix. Turn the heat up and stir until the mixture thickens and you are left with a thick masala paste (10-15 minutes).\n8) Add the chicken pieces and stir into the thick masala to coat it.\n9) Reduce the heat and place the lid on the pan. Leave to cook for about 20 minutes, stirring every now and again.\n10) The chicken will produce a lovely thick gravy. Once the chicken is cooked through you can adjust the consistency of the sauce to your preference. To loosen, just add a little hot water, or to reduce it and make it thicker, cook further on a high flame.\n11) Once cooked, add some black pepper and a squeeze of lemon, then check the seasoning.\n12) Stir in the chopped coriander and serve.",
    "": ""
  },
  {
    "Dish Name": "Chicken Burrito",
    "Description": "Chicken Chaat Roti",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "20 mins",
    "Ingredients": "1) 260g Roti flour\n2) ½ tsp salt\n3) 2 tsp oil\n4) 50g big handful of spinach\n5) 100ml warm milk",
    "Instructions": "1) Heat water in a pan and add spinach. Blanch for a minute then remove and rinse under cold water.\n2) Place the cooked spinach into a blender and add the milk. Blitz to a puree and set to one side.\n3) In a bowl, mix flour, salt and oil together. Pour in the spinach and puree a little at a time and knead to make a soft dough.\n4) Cover the dough with a damp cloth and leave to rest for 20 minutes.\n5) When ready to cook, heat your tava or frying pan to a medium heat.\n6) Roll out the roti and place on the pan to cook. Once it changes colour a little, turn and cook the other side. Place in a tea towel to keep warm.",
    "": ""
  },
  {
    "Dish Name": "Chicken Chaat",
    "Description": "Tangy Shredded Chicken",
    "Spice": "hot",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "10 mins",
    "Ingredients": "1) 4 chicken thighs, skinned and trimmed\n2) 3 cloves garlic\n3) 1 tsp salt\n4) 1 tbsp vegetable oil\n5) 1 onion, finely diced\n6) 2 green chillies, finely chopped\n7) 2-4 tbsp tamarind water, or juice from 1 lemon\n8) 1 tsp red chilli powder\n9) 1 tsp mango powder (amchoor)\n10) Handful of fresh coriander, chopped",
    "Instructions": "1) Place chicken in a pan and cover with water, add the garlic cloves, salt and place on a gentle heat.\n2) Cook for about 10 minutes and remove from the water and leave to cool. Retain the water as stock.\n3) Heat the oil in a pan and add the onions, cook gently until browned.\n4) Add the green chilli, salt to taste and pour in the tamarind water with a little of the stock water from the chicken.\n5) Cook gently and let the sauce reduce. Add a little more stock and cook to thicken. After about 5 minutes add both the chilli and mango powders.\n6) Once the chicken has cooled, shred it using two forks and add to the sauce.\n7) Stir to coat and leave to cook for a few minutes.\n8) Remove from the heat and sprinkle in the garam masala and a handful of fresh coriander.",
    "": ""
  },
  {
    "Dish Name": "Chicken Salad with Pink Grapefruit and Cumin Dressing",
    "Description": "Spicy Chicken Salad",
    "Spice": "mild",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "15 mins",
    "Ingredients": "1) 4 chicken thighs, trimmed\n2) 5cm piece ginger\n3) 3 cloves of garlic\n4) 1 pink grapefruit, juice\n5) 1 tbsp oil,\n6) 1 tsp chilli powder\n7) 1 tsp garam masala\n8) salt to taste",
    "Instructions": "1) Heat the oven to 180ºC.\n2) Cut the chicken into chunks and set to one side.\n3) Crush the ginger and garlic in a pestle and mortar and place in a bowl.\n4) Squeeze in the juice from the grapefruit and pour in the oil, chilli powder, garam masala and salt.\n5) Mix the chicken to marinade for a few minutes then place onto a baking sheet and cook in the oven for 15-20 minutes until cooked through.\n6) Meanwhile, mix the dressing ingredients with juice from half the grapefruit in a jam jar and shake to mix.\n7) With the other half of the grapefruit slice out the segments.\n8) Once the chicken is cooked leave to cool.\n9) Put the salad leaves into a bowl and dress with the dressing then place the pieces of chicken onto the salad with the segments of grapefruit.\n10) Sprinkle over the mint and coriander and serve.",
    "": ""
  },
  {
    "Dish Name": "Chole Bhatura",
    "Description": "Tangy Chickpeas and Fluffy Bread",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "20 mins",
    "Ingredients": "1) 400g tin of chickpeas\n2) 2 black teabags in mug with boiling water poured over\n3) 5cm piece tamarind, soaked in about 100ml boiling water\n4) 1 tbsp ghee\n5) 1 tsp cumin seeds\n6) 2 medium onions, thinly sliced\n7) 4 cloves of garlic, sliced\n8) 4cm piece ginger, grated\n9) 2-3 green chillies, sliced lengthways\n10) 400g tin of plum tomatoes\n11) 1 tsp Kashmiri chilli powder\n12) 1tsp turmeric\n13) 1 tsp coriander seeds, crushed\n14) 2 tsp cumin seeds, crushed\n15) ½ tsp black salt\n16) Salt to taste\n17) ½ tsp garam masala\n18) 1 tbsp lemon juice\n19) 1 heaped tsp amchoor / chaat masala\n20) Fresh coriander, roughly chopped for garnish",
    "Instructions": "1) In a heavy-bottomed saucepan, heat the ghee and add the cumin seeds. Once they sizzle and the sliced onions and cook for 5-10 minutes until they turn golden.\n2) Stir in the sliced garlic and keep stirring until it starts to change colour. Add the ginger and sliced chilli.\n3) Fry for a minute and then add the tomatoes and tea water before sieving in the tamarind water. Leave this to simmer away and cook down until the tomatoes and onions start to combine to create a thick masala.\n4) Add the chilli powder, ground coriander, cumin and turmeric. Stir for a few minutes until the masala is aromatic and thick.\n5) Drain the water from the tinned chickpeas and place into the masala. Add a little water and leave to cook on a gentle heat for 5-10 minutes.\n6) Sprinkle in the black salt and leave to cook for about 5 minutes.\n7) Keep an eye on the pan and stir every few minutes. Add more liquid if required.\n8) Check the seasoning and adjust if required. Make sure the chickpeas are nice and soft and the sauce is thick.\n9) Add the garam masala and a good squeeze of fresh lemon juice and sprinkle over the amchoor.",
    "": ""
  },
  {
    "Dish Name": "Corn and Pomegranate Kachumber",
    "Description": "Corn and Pomegranate Salad",
    "Spice": "mild",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "",
    "Ingredients": "1) 300g tin sweetcorn\n2) ¼ of a cucumber, peeled and diced\n3) 2 tomatoes, diced\n4) crunchy corn (bought from supermarkets)\n5) handful of pomegranate jewels\n6) handful of pea shoots",
    "Instructions": "1) Wash the corn and leave to dry.\n2) Mix all the dressing ingredients in jam jar and shake to mix all the flavours together. Set to one side.\n3) Place in a bowl the corn with the diced cucumber and diced tomatoes.\n4) Sieve the dressing over the salad and toss it together.\n5) Sprinkle in the pea shoots and finally, sprinkle the crunchy corn and pomegranate on top and serve.",
    "": ""
  },
  {
    "Dish Name": "Cucumber Raita",
    "Description": "Cucumber Yoghurt",
    "Spice": "",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "",
    "Ingredients": "1) ½ cucumber (more if you want)\n2) 200ml low-fat natural set yoghurt (I also like to use Greek yoghurt)\n3) 1 tsp garam masala\n4) 1 tsp Kashmiri chilli powder",
    "Instructions": "1) Carefully grate the cucumber, leaving the skin on.\n2) Either using a cloth or just your hands, squeeze any excess liquid from the cucumber.\n3) Once it is drained place in a small bowl.\n4) Add the yoghurt and garam masala and stir the cucumber through.\n5) Sprinkle the chilli on top to serve.",
    "": ""
  },
  {
    "Dish Name": "Curried Butternut Squash Soup",
    "Description": "50 mins",
    "Spice": "hot",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "40 mins",
    "Ingredients": "1) 1 butternut squash\n2) 1 red onion, chopped\n3) 1 tsp cumin seeds\n4) 2 garlic cloves, chopped finely\n5) 3cm piece ginger, grated\n6) 2 red chillies, chopped (keep some for garnish)\n7) 500ml water or chicken stock\n8) 50ml coconut cream",
    "Instructions": "1) Slice the squash into four long strips, remove the seeds and place on a tray with a little knob of butter on each and roast at 180°C for about 35 minutes until soft.\n2) Meanwhile heat some oil and add cumin seeds until fragrant, then add onions and cook gently until soft.\n3) Stir in the garlic and ginger and chilli and cook gently for about 5 minutes.\n4) Once the squash is soft scrape the flesh out and discard the skin. Stir the flesh into the onions.\n5) Add the stock and cook through until everything is soft (about 5 minutes).\n6) Using a hand blender blitz the soup until it's smooth and thick. Pour in the coconut cream and if it's too thick add a little hot water.\n7) Pour into bowls and top with a swirl of coconut cream and a chopped chilli. Serve with some crisp naan bread.",
    "": ""
  },
  {
    "Dish Name": "Dal Bhat",
    "Description": "Nepalese Lentil Soup",
    "Spice": "mild",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "20 mins",
    "Ingredients": "1) 2 tbsp ghee or oil\n2) 1 onion, finely chopped\n3) 2 garlic cloves, minced\n4) 5cm piece of ginger, grated\n5) 1 tsp coriander seeds, crushed\n6) 1 green chilli (optional)\n7) ½ tsp red chilli powder\n8) ½ tsp turmeric\n9) 200g red lentils, washed\n10) 700ml water\n11) 1 tsp salt",
    "Instructions": "1) Heat the ghee or oil in a large frying pan and cook the onions until translucent but not brown.\n2) Turn the heat to low and add in the garlic, ginger, chopped chilli (if using) crushed coriander seeds, red chilli powder and turmeric. Stir to combine for about 3 minutes or so.\n3) Add the red lentils and mix with the onion mixture.\n4) Pour thd water in and bring it to a boil, add the salt and reduce heat to a simmer for about 15 minutes or until the lentils are tender.\n5) Remove from the heat and stir in the fresh coriander.",
    "": ""
  },
  {
    "Dish Name": "Dhal Makhani",
    "Description": "Buttery Black Lentil Dhal",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "30 mins",
    "Ingredients": "1) 100g dry urid dhal (whole black lentils)\n2) 25g dry rajma (kidney beans)",
    "Instructions": "1) Clean, wash and soak the black lentils and kidney beans separately, overnight.\n2) Drain and keep aside. Combine the two dhals and add 2 cups of water with a little salt and put into a pressure cooker and cook for about 25 minutes until they are cooked and soft. (DO NOT REMOVE the lid of the pressure cooker until fully cooled and pressure has been released.)\n3) Heat the oil in a pan and add cumin seeds.\n4) When the cumin seeds crackle, add chopped onions and garlic.\n5) Fry the onion until golden brown over a medium flame.\n6) Stir in the tomato purée, add the turmeric, chilli powder, ginger, green chillies and crushed coriander.\n7) Cook for a few minutes so the onions and tomatoes melt together.\n8) Add the cooked dhal and 1 cup of water and season with a little salt to taste.\n9) Leave to simmer for 15 minutes until it is lovely and thick. (Take care as it may catch on the bottom of the pan.)\n10) Stir in the butter, garam masala and fenugreek to make the dhal rich and delicious.\n11) Garnish with a sprinkle of fresh coriander and serve.",
    "": ""
  },
  {
    "Dish Name": "Easy Chicken Curry",
    "Description": "Chicken masala",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "30 mins",
    "Ingredients": "1) 2 tbsp oil\n2) 400g chicken thigh fillets, trimmed and chopped\n3) 2 large onions\n4) 1 tsp salt\n5) 3 cloves of garlic\n6) 3cm fresh ginger\n7) 1 or 2 green chillies\n8) 200g plum tomato tin, pureed\n9) ½ tsp turmeric powder\n10) ½ tsp red chilli powder\n11) 1 tsp garam masala powder\n12) Large pinch of fresh coriander, chopped",
    "Instructions": "1) Blend the onions in a food processor.\n2) Heat oil in a pan and sauté the onion paste. If it starts to stick, just add a little water and stir.\n3) Stir in the salt to help the onions cook.\n4) Put the ginger, garlic and chillies into a blender and blend to a paste (add a little water if required)\n5) After 10 minutes of cooking the onions they should have browned a little. Now stir in the garlic, ginger and chilli paste.\n6) Once softened add the pureed tinned tomatoes and increase the heat until the tomatoes start to simmer.\n7) Reduce the heat and add the turmeric, chilli powder and garam masala. Cook together until the tomatoes and onions start to break down and the masala dries up and becomes paste-like.\n8) Add chicken pieces into the masala. Stir well and cook for a few minutes. Reduce the heat to the lowest setting and put the lid on the pan. Leave to cook for about 15-20 minutes, stirring intermittently.\n9) The chicken should be cooked through. To add a little more gravy pour in some hot water and stir before removing from the heat.\n10) Check the seasoning and adjust if you need to. Sprinkle in the coriander and stir.\n11) Serve with plain rice or roti.",
    "": ""
  },
  {
    "Dish Name": "Fennel and Seafood Salad",
    "Description": "30 mins",
    "Spice": "mild",
    "Prep Time": "Prep 20 mins",
    "Cook Time": "20 mins",
    "Ingredients": "1) 200g raw prawns\n2) ½ tsp chilli powder\n3) salt to taste\n4) 200g raw squid\n5) ½ tsp turmeric\n6) 1 fillet of salmon, skinned and chopped into chunks\n7) ½ tsp chaat masala\n8) salt\n9) 1 bulb of fennel\n10) 1 ripe nectarine, sliced\n11) handful fresh coriander, chopped",
    "Instructions": "1) Sprinkle the chilli powder and salt on the prawns and griddle or fry in a pan until cooked through and set to one side.\n2) Sprinkle the squid with the turmeric and salt and fry until cooked through.\n3) Coat the fish with the chaat masala and place on an oven tray and cook at 180C for 5 minutes.\n4) Slice the fennel very finely and sprinkle with a little oil and griddle.\n5) Mix all the ingredients for the dressing and leave to one side.\n6) Place fennel into a bowl and sprinkle with coriander leaves, the cooked seafood and then pour over the marinade and toss together.\n7) Slice the nectarine and place into the bowl and serve.",
    "": ""
  },
  {
    "Dish Name": "Fennel and Tomato Shorba",
    "Description": "Fennel and Tomato Soup",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "20 mins",
    "Ingredients": "1) 2 tbsp oil\n2) 1 tsp fennel seeds\n3) 5 cloves of garlic, sliced\n4) 2 green chillies\n5) 1 tsp salt\n6) 400g ripe tomatoes, roughly chopped\n7) fresh coriander, 1 handful\n8) approx 750ml water\n9) 1 tsp fennel, roasted and roughly crushed for the garnish",
    "Instructions": "1) Heat oil and add the fennel seeds, when they sizzle add the garlic and cook until it starts to brown.\n2) Throw in the whole green chillies and the salt.\n3) Add the chopped tomatoes and increase the heat to start them cooking.\n4) Pour over enough water to just cover the tomatoes and bring to a boil then add in the coriander.\n5) Leave it to simmer for 15-20 minutes.\n6) Blitz with a hand blender until smooth.\n7) Return to the stove for 5 minutes then pour into serving bowls or cups.\n8) Sprinkle with roasted fennel serve.",
    "": ""
  },
  {
    "Dish Name": "Goan Fish Curry",
    "Description": "Goa di Machchi",
    "Spice": "hot",
    "Prep Time": "Prep 30 mins",
    "Cook Time": "20 mins",
    "Ingredients": "1) 600g skinless white fish fillets, chopped into chunks",
    "Instructions": "1) Mix the salt, lemon juice and turmeric powder and rub over the fish chunks and leave to marinate for 30 minutes.\n2) Soak the dried chilli in 250ml of warm water for 15 minutes. Drain and reserve the water.\n3) Make up the spice paste by placing the soaked chillies, coconut, coriander seeds, chopped onion, cumin seeds, turmeric powder, garlic, tamarind extract and two tablespoons of the reserved soaking water in a blender and process to make a smooth paste.\n4) Heat oil in a shallow wide based pan and add the sliced onion and fry to soften - do not brown. Add the spice paste and cook until golden brown. You may need a splash of water to ensure the paste doesn't burn.\n5) Once aromatic stir in the tomato purée and fresh chillies and cook for a further five minutes.\n6) Add water (or coconut milk if you prefer) to create a lovely sauce, bring to the boil and cook for a few more minutes.\n7) Reduce the heat and gently place the marinated fish with any juice into the pan and cook for between five and seven minutes until the fish is soft.\n8) Sprinkle with coriander to serve.",
    "": ""
  },
  {
    "Dish Name": "Gol Guppa",
    "Description": "Pani Puri",
    "Spice": "medium",
    "Prep Time": "Prep 40 mins",
    "Cook Time": "15 mins",
    "Ingredients": "1) 200g fine semolina\n2) 4 tbsp plain flour, plus some for dusting\n3) Salt, pinch\n4) Black pepper, pinch\n5) 130ml sparkling water\n6) Vegetable oil for frying",
    "Instructions": "1) To make the puris, place the semolina, flour, a pinch of salt and pepper into a bowl, and gradually add the sparkling water.\n2) Stir continuously until the mixture comes together and forms a soft dough. Place into a bowl that has been dusted with flour and cover with a damp tea towel for about 30 minutes.\n3) Place a large, deep pan or a wok on a gentle heat and pour in the vegetable oil and allow it to get really hot.\n4) Separate the dough into 4 bits and roll it out so it's thin (about 1mm thick). Using a 5cm cutter cut out as many circles as you can. Or take small grape sized balls of the puri dough and roll into a ball with your hands. On a floured surface roll it out to make thin, flat circles, about 5-6cm across.\n5) To test if it's hot enough, drop a tiny piece of dough into the pan – if it floats to the surface and starts to sizzle, it's ready.\n6) Very gently slide in one circle of puri dough and fry for 2 to 3 minutes. Then using your spoon to push them under the oil, then carefully flip them over and continue cooking for 1-2 minutes, until it's golden and crisp. Transfer to a kitchen paper to drain, and repeat with the remaining dough.",
    "": ""
  },
  {
    "Dish Name": "Green Chilli Sauce",
    "Description": "Hot Green Sauce",
    "Spice": "hot",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "20 mins",
    "Ingredients": "1) 100g large green chilli (mild)\n2) 100g rocket green chilli (hot)\n3) 175ml white vinegar\n4) 2 tsp cumin seeds\n5) 5 cm root ginger\n6) 1½ tsp salt\n7) 2 pinches asafoetida\n8) 3 tbsp oil",
    "Instructions": "1) Put some kitchen gloves on and wash the green chillies. Remove the stems and cut it into large chunks.\n2) Wash the ginger and cut it into small bits.\n3) Heat oil in a pan then add the cumin seeds and asafoetida until fragrant.\n4) Add the green chillies and ginger to the pan stir in the salt and cook for 2 minutes.\n5) Pour in 70ml water and put the lid on the pan - leave to cook for about 15 minutes on a gentle heat stirring occasionally.\n6) Once soft (after about 15 minutes) take the lid off and leave to reduce for a few minutes then remove from the heat and leave to cool.\n7) Pour into a blender and blitz. Pour in the vinegar a little at a time and blend.\n8) Once ready store the chilli sauce in a clean, dry jar. This will keep for 2-3 months.",
    "": ""
  },
  {
    "Dish Name": "Gurkha Chicken Curry",
    "Description": "Nepalese chicken curry",
    "Spice": "mild",
    "Prep Time": "Prep 2 hrs 10 mins",
    "Cook Time": "1 hr",
    "Ingredients": "1) 5 green cardamom pods\n2) 1 tsp fennel seeds\n3) 1 tbsp ginger, roughly chopped\n4) 3 garlic cloves, roughly chopped\n5) 150g Greek yoghurt\n6) 8 pieces of chicken, thigh and drumsticks skinned\n7) 2 tbsp rapeseed oil\n8) 2 onions, sliced\n9) 2 tsp cumin seeds\n10) 4 cloves\n11) 7cm stick of cassia bark\n12) 2 bay leaves\n13) 1 tsp turmeric\n14) ½ tsp mace, ground\n15) ¼-1 tsp Kashmiri chilli powder\n16) 4 medium tomatoes, chopped",
    "Instructions": "1) Toast the cardamom pods with the fennel seeds until fragrant. Remove from the pan and let them cool.  Crush with a pestle and mortar and remove the husk.\n2) Add the ginger and garlic to the pestle and mortar and bash the to make a paste.\n3) Put the yoghurt into a large bowl and add the spice paste with the salt and stir to combine everything.\n4) Add the chicken and coat it all over, leave it to mariante for at least 2 hours.\n5) When you are ready to cook heat the oil in a large oven-proof pan.\n6) Remove the chicken and scrape off the excess marinade back into the bowl, reserve this for later.\n7) Add the chicken to the pan and fry for 5 minutes on one side until brown, then turn it over and cook for another 4-5 minutes.\n8) Remove the chicken from the pan and set to one side.\n9) Add a little more oil and add the cumin seeds, cloves, bay and cassia bark to the pan. When the spices are fragrant add the onions and saute for about 10 minutes until they turn golden brown.\n10) Add the turmeric, mace and chilli powder and cook for a further 1 minute.\n11) Add water (approx 250ml) to the pan and simmer for 2-3 minutes until it’s reduced.\n12) Mix the chopped tomatoes in with the remaining marinade and add it all to the pan.\n13) Stir and then add the chicken back to the pan. Simmer on a low heat for 40 minutes or place in the oven at 180ºC for the same amount of time.",
    "": ""
  },
  {
    "Dish Name": "Halibut with Indian spices",
    "Description": "1 hr 16 mins",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "6 mins",
    "Ingredients": "1) 2 tsp cumin seeds\n2) 2 tsp coriander seeds\n3) 2 tsp fennel seeds\n4) 4 cloves\n5) 1 tsp turmeric\n6) ½ tsp chilli powder (add more for more heat)\n7) 4 halibut fillets or steaks (approx 140g each)\n8) 1-3 tbsp mustard oil",
    "Instructions": "1) In a dry cast-iron pan, toast the cumin, coriander, fennel, and cloves over medium heat until fragrant, about two minutes. Leave to cool for a few minutes.\n2) Transfer to a spice grinder or a mortar and grind to a fine powder. Put the ground spices in a small bowl and add the turmeric and chilli powder.\n3) Lay the halibut on a baking sheet and season with salt and pepper. Drizzle with the mustard oil. Sprinkle the spice mixture over the fish, then massage it in. Cover and refrigerate for an hour. Bring the fish to room temperature before cooking.\n4) Fry the halibut for 3 minutes on each side, until it's just opaque throughout. You can also cook the fish under a grill or baked it in the oven at 180°C for 10 minutes.",
    "": ""
  },
  {
    "Dish Name": "Indian Slaw",
    "Description": "Spiced Coleslaw",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "",
    "Ingredients": "1) 2-3 medium carrots, peeled and coarsely shredded\n2) half a white cabbage, cored and finely shredd\n3) 1 red onion, halved and finely sliced\n4) 3 tbsp Greek yogurt\n5) 2 tbsp mayonnaise\n6) Juice of half a lemon,\n7) ½-1 red chilli (or to taste), finely sliced\n8) ½ tsp cumin seeds, toasted\n9) ½ tsp Kashmiri chilli powder\n10) 1 tsp turmeric\n11) ½ tsp salt (or to taste)\n12) handful of fresh coriander, chopped\n13) 40g cashews, toasted",
    "Instructions": "1) In a large bowl, mix the carrots, cabbage and onion.\n2) Toast the cumin seeds in a dry pan until aromatic and keep to one side\n3) Toast the cashew nuts until golden and set a side.\n4) Mix the yogurt, mayonnaise, lime juice, chopped chilli, toasted cumin seeds, turmeric, chilli powder, salt and tip into the shredded veg mix. Stir to mix everything together.\n5) Stir in half the coriander and half the cashews. Top with remaining coriander and cashews just before serving.",
    "": ""
  },
  {
    "Dish Name": "Indian Summer Greens",
    "Description": "20 mins",
    "Spice": "mild",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "10 mins",
    "Ingredients": "1) 1 tbsp butter\n2) 1 tsp cumin seeds\n3) ½ tsp mustard seeds\n4) 4 green chillies, finely chopped\n5) 4cm piece root ginger\n6) ½ tsp turmeric\n7) 500g summer greens, shredded\n8) 100g peas / blanched broad beans\n9) 1 lemon\n10) 2 tbsp coconut, grated\n11) 1 tsp garam masala",
    "Instructions": "1) Heat the butter in a large non-stick pan or wok, sizzle the cumin and mustard seeds until fragrant, then add the chilli, ginger and turmeric.\n2) Fry until aromatic, then add the greens, a pinch of salt, a splash of water and the peas or broad beans.\n3) Cook for 4-5 mins until the greens have wilted.\n4) Add a squeeze of lemon juice, garam masala and the coconut, then toss everything together to serve.",
    "": ""
  },
  {
    "Dish Name": "Jamaican Chicken Curry",
    "Description": "Chicken Curry",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "30 mins",
    "Ingredients": "1) 1 whole chicken, cut into pieces or 8 pieces of chicken on the bone, skinned\n2) 1 tsp salt\n3) 1 tsp ground black pepper\n4) 1 tsp all purpose seasoning\n5) 1 tsp chicken seasoning\n6) 1 tsp curry powder\n7) 2 tbsp vegetable oil\n8) 3 spring onions\n9) 1 medium onion\n10) 4 springs of fresh thyme\n11) 3 garlic cloves\n12) 1 whole scotch bonnet pepper\n13) 2 tsp curry powder\n14) 1 large carrot, 5cm chunks\n15) 2 potatoes, 5cm cubes",
    "Instructions": "1) Mix the marinade ingredients and rub all over the chicken pieces, leave to one side for a couple of hours.\n2) Heat vegetable oil in a saucepan over medium heat, adding garlic, onion, spring onion and scotch bonnet pepper and stir for 3 minutes.\n3) Add 2 tsp of curry powder and cook for further 5 minutes.\n4) Add marinated chicken and brown for 10 minutes, turning chicken and browning for a further 5 minutes.\n5) Add carrots and potato with a cup of water and cook through until the vegetables are tender.",
    "": ""
  },
  {
    "Dish Name": "Jeera Chaul",
    "Description": "Cumin and Pea Rice",
    "Spice": "",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "15 mins",
    "Ingredients": "1) 1 tbsp oil\n2) 1 tsp cumin seeds\n3) 1 small onion, finely sliced\n4) 200g/1 mug Basmati rice\n5) 50g frozen peas\n6) 500ml/2 mugs full, cold water",
    "Instructions": "1) Wash the rice until the water runs clear. I do this by covering the rice with water and running my hand through it, pouring the starchy water away then refilling with cold water and repeating until the water runs clear. Strain in a sieve and leave.\n2) In a wide based pan heat the oil and add the onions and fry until translucent.\n3) Add the whole cumin seeds. When they sizzle and become fragrant stir in the frozen peas\n4) Add the washed rice, stir to coat with the oil then pour in 500ml of water (twice the amount of water to rice).\n5) Bring the water to a vigorous rolling boil, reduce the heat to the lowest setting and place the lid on the pan.\n6) Leave to cook for 12 minutes do not remove the lid - be patient!\n7) After 12 minutes remove from the heat and take the lid off. Leave to sit for a couple of minutes. All the water will all be absorbed and the rice will be light and fluffy.\n8) Gently fork through the rice (never dive straight in) and serve.",
    "": ""
  },
  {
    "Dish Name": "Jeera Pani",
    "Description": "Cumin soda water",
    "Spice": "none",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "",
    "Ingredients": "1) Handful of mint leaves\n2) 2 litres soda water\n3) 1 tsp toasted ground cumin\n4) ½ tsp ground black pepper\n5) Juice of 2 limes\n6) Good pinch of sea salt\n7) 1 heaped tbsp sugar",
    "Instructions": "1) Bash the mint leaves between your palms to release their flavourful aroma, then place in a jug with the soda water, cumin and black pepper.\n2) In a dish or using a pestle and mortar, mix together the lime juice, salt and sugar until the sugar has dissolved.\n3) Add the sugar mixture to the soda water, stir until well combined (or use a blender if preferred) and serve, with or without ice, in long glasses on hot days.",
    "": ""
  },
  {
    "Dish Name": "Jeera Raita",
    "Description": "Cumin Yoghurt",
    "Spice": "mild",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "5 mins",
    "Ingredients": "1) 200ml natural set yoghurt\n2) A splash of milk\n3) 1 tbsp cumin seeds\n4) ½ cucumber, cubed\n5) 1 large tomato, cubed\n6) ½ red onion, very finely diced\n7) ½ tsp salt\n8) 1 tsp chilli powder\n9) 1 tsp garam masala\n10) Coriander to garnish",
    "Instructions": "1) Heat a non-stick frying pan, add the cumin seeds and dry roast gently.\n2) Stir until they turn a shade darker and release their musky aroma.\n3) Remove and crush the seeds in a pestle and mortar.\n4) Put the yoghurt in a large bowl and add enough milk to get a runny consistency.\n5) Add the chopped tomatoes, cucumber, onion, salt and cumin.\n6) Stir together. Sprinkle on the chilli powder and garam masala.\n7) Garnish with coriander sprigs and refrigerate until required.",
    "": ""
  },
  {
    "Dish Name": "Kachumber Salad",
    "Description": "Tomato, Onion and Cucumber Salad",
    "Spice": "medium",
    "Prep Time": "Prep 20 mins",
    "Cook Time": "",
    "Ingredients": "1) 1 small red onion\n2) ½ cucumber\n3) 1 tomato\n4) Fresh coriander leaves\n5) 1 lemon\n6) 1 tsp salt\n7) ½ tsp garam masala",
    "Instructions": "1) Cut the onions, cucumber, tomato into a very fine dice and place into a bowl.\n2) Finely chop the coriander and place into the bowl.\n3) Squeeze in the lemon and sprinkle in the salt and garam masala - stir and serve.",
    "": ""
  },
  {
    "Dish Name": "Kale and Chickpea Curry",
    "Description": "Sholay Saag",
    "Spice": "medium",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "25 mins",
    "Ingredients": "1) 1-2 tbsp rapeseed oil\n2) ½ tsp mustard seeds\n3) 1 tsp cumin seeds\n4) 1 large onion, diced\n5) 4 garlic cloves, crushed\n6) 4 plum tomatoes or 200g tinned tomatoes\n7) 800g/2 tins of chickpeas, drained and rinsed\n8) 1 tsp salt, or to taste\n9) 1 heaped tsp coriander seeds, crushed\n10) 1 green chilli, chopped\n11) 1 tsp red chilli powder\n12) 1 tsp turmeric\n13) 200g kale, chopped\n14) 1 green chilli, sliced for garnish",
    "Instructions": "1) Heat the oil in a lidded pan over a medium heat and when it's hot add the mustard seeds and then the cumin seeds.\n2) Stir for a minute until you can smell the aroma of the cumin seeds and the mustard seeds stop sizzling, then add the diced onions.\n3) Fry the onions for 15 minutes until they start to brown, then add the garlic. Fry together for 4 minutes before adding the tomatoes, stir and leave to cook for a few minutes. Add a little water if required.\n4) Add the crushed coriander, green chilli, chilli powder, turmeric and salt and leave to cook on a gentle heat until the tomatoes start to break down and create a thick masala sauce (about 10 minutes).\n5) Turn the heat up to thicken the sauce a little if required.\n6) Add the chickpeas and stir to coat them with the masala. Add a splash of water and let them simmer for 5 minutes.\n7) Add the chopped kale, a handful at a time, stirring in between. Leave this to cook for 5 minutes until kale is soft and tender. Top with the sliced chilli and serve with poori with some fresh plain yoghurt.",
    "": ""
  },
  {
    "Dish Name": "Kasundi Halibut with Cumin Kale Crisps",
    "Description": "Halibut with mustard and mango sauce and kale crisps",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "10 mins",
    "Ingredients": "1) 4 pieces of chunky halibut or white fish\n2) Juice from 1 lemon\n3) 1 tbsp mustard paste\n4) 1 garlic clove, crushed\n5) 1 tsp cumin seeds, crushed\n6) ½ tsp salt\n7) ½ tsp turmeric\n8) ¼ tsp chilli powder\n9) 1 tbsp rapeseed oil",
    "Instructions": "1) Combine all the ingredients except the halibut in a wide bowl so they are mixed together to form a yellow mixture\n2) Coat the pieces of fish with the mixture and leave to marinade for as long as possible\n3) To cook the fish, heat a drizzle of rapeseed oil in a non-stick frying pan. Once smoking, place fish in the pan reduce the heat and cook for 4-5 minutes. Turn it over and cook for a further 4 minutes until cooked through.",
    "": ""
  },
  {
    "Dish Name": "Kati Egg Roll with Basmati & Quinoa",
    "Description": "Spiced rice tucked into a kati egg roll",
    "Spice": "mild",
    "Prep Time": "Prep 35 mins",
    "Cook Time": "10 mins",
    "Ingredients": "1) 100g Brown Basmati rice (or use left over rice)\n2) 20g Quinoa\n3) 1 tbsp Rapeseed oil\n4) 1 tsp cumin seeds\n5) 1 onion, sliced\n6) 1 clove of garlic, chopped\n7) 4 mushrooms, chopped\n8) ½ tsp salt\n9) 1 fresh green chilli, chopped\n10) 2 tomatoes, chopped\n11) Handful of spinach\n12) Large pinch of coriander\n13) 1 tsp garam masala\n14) 2 tsp chaat masala\n15) 100g grated paneer",
    "Instructions": "1) Wash the quinoa and rice then add to a pan of boiling water simmer gently for 25 minutes.\n2) Drain well and cover for a few minutes.\n3) Heat oil in a pan and add the cumin seeds until the sizzle. Stir in the sliced onion and cook for 2-3 minutes until translucent then add the garlic and cook for 3-4 minutes.\n4) Add the chopped mushrooms and cook for a few minutes with salt and chilli.\n5) Add the tomatoes and cook to a paste before adding the spinach.\n6) Stir in the cooked rice and add 1 tsp of garam masala, the chopped coriander and the paneer. Check the seasoning and set to one side.\n7) Heat a non-stick frying pan and add the oil.\n8) Whisk the eggs in a wide bowl and add garam masala, chilli powder and salt.\n9) Dip in one tortiila wrap and place into the frying pan on a gentle heat and cook until crisp.\n10) Gently place the wrap onto a plate and fill with the cooked rice and roll it up. Serve with pickle and yoghurt.",
    "": ""
  },
  {
    "Dish Name": "Kedgeree",
    "Description": "Spice rice with smoked fish",
    "Spice": "mild",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "20 mins",
    "Ingredients": "1) 2 large free-range eggs\n2) 700g smoked haddock fillets, boned\n3) 2 fresh bay leaves\n4) 170g basmati rice\n5) salt to taste\n6) ½ tbsp ghee\n7) 3cm piece fresh ginger, grated\n8) 1 bunch of spring onions, finely chopped\n9) 1 clove garlic, peeled and finely chopped\n10) 1 tsp cumin seeds, crushed\n11) ½ tsp turmeric\n12) 2 tsp mustard seeds\n13) 2 tomatoes, finely chopped\n14) juice of 2 lemons\n15) 2 good handfuls fresh coriander, chopped\n16) 1 fresh red chilli, finely chopped",
    "Instructions": "1) Boil the eggs for 10 minutes, then hold under cold running water.\n2) Put the fish and bay leaves in a shallow pan with enough water to cover. Bring to the boil, cover and simmer for about 5 minutes, until cooked through. Remove from the pan and leave to cool. Remove the skin from fish, flake into chunks and set aside.\n3) Cook the rice in water for about 10 minutes and drain. Fork through and leave to cool leave in the fridge until needed.\n4) Melt the ghee in a pan over a low heat and add the mustard and cumin seeds.\n5) Stir in the ginger, onion and garlic. Soften for about 5 minutes, and add the turmeric, salt and chilli. Cook for a further few minutes, then add the chopped tomatoes and lemon juice.\n6) Stir in the cooked rice and heat through then add the fish. Once piping hot remove from the heat and add the fresh coriander.\n7) Slice the eggs into quarters and place on top of the rice to serve.",
    "": ""
  },
  {
    "Dish Name": "Keema Burrito",
    "Description": "Keema Roti Roll",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "20 mins",
    "Ingredients": "1) 250g Roti flour\n2) ½ tsp salt\n3) 2 tsp Rapeseed oil\n4) water",
    "Instructions": "1) In a bowl or stand mixer, mix flour, salt and oil together. Knead to a soft dough.\n2) Cover the dough with a damp cloth and leave to rest for 20 minutes.\n3) When you are ready to cook, heat your tava or frying pan to a medium heat.\n4) Roll out the roti and place on the pan to cook. Once it changes colour a little, turn and cook the other side. Place in a tea towel to keep warm.",
    "": ""
  },
  {
    "Dish Name": "Kukul Mass",
    "Description": "Sri Lankan Chicken Curry",
    "Spice": "hot",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "50 mins",
    "Ingredients": "1) 8-10 chicken pieces (thighs and drumsticks - skin on)",
    "Instructions": "1) In a pan toast the cumin, coriander, fennel and black peppercorns. If you don’t like using whole spices you can also add the cardamom, cloves, and cassia at this stage rather then in step 4.\n2) Grind everything in a spice grinder to a powder. Add turmeric and paprika to the ground spices and mix well to combine.\n3) Sprinkle the spice mix over the chicken and set to one side.\n4) Heat the coconut oil in a wide pan and add the cardamom pods, cloves, dried red chillies, cassia bark or just the curry leaves if you added the whole spices in step 1. Fry for a minute then add the diced onion and cook until golden.\n5) Stir in the garlic, ginger and chopped chillies - cook for a few minutes. Let it catch a little on the bottom and then if you are using tomatoes you can add them now. Stir to break them down (I prefer this recipe without tomatoes).\n6) Add the chicken to the pan and coated with the onions then sprinkle in 1 tsp salt and kewra water (if using).\n7) Add the coconut milk, the bruised lemongrass, cover and cook on a low heat for 40–50 minutes.\n8) Toast the coconut shavings until golden and sprinkle over the curry to serve.",
    "": ""
  },
  {
    "Dish Name": "Lamb Jalfrezi",
    "Description": "Lamb with Peppers",
    "Spice": "hot",
    "Prep Time": "Prep 20 mins",
    "Cook Time": "40 mins",
    "Ingredients": "1) 400-600g lamb shoulder, trimmed and chopped",
    "Instructions": "1) Heat oil in a pan, add the cumin seeds, chilli and garlic and fry until lightly browned.\n2) Add the chopped tomatoes, salt and turmeric then cook so the tomatoes break down to make a lovely thick gravy.\n3) Add the lamb and stir to coat the pieces. Reduce the heat and place the lid on the pan and leave to cook for 30-40 minutes on a low heat until it's soft and tender.\n4) In a separate pan heat some oil and add the cumin seeds, once fragrant stir in the chunky onions and peppers, tomato and the chilli then stir fry. You can cook these as much or as little as you like. I prefer mine with a bit of a crunch.\n5) Stir in the garam masala for added body and depth.\n6) Once the lamb is cooked and the sauce has reduced stir in the garam masala fried vegetable mix.",
    "": ""
  },
  {
    "Dish Name": "Lemon Masala Chicken",
    "Description": "Lemon Chicken Curry",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "30 mins",
    "Ingredients": "1) 8 pieces of chicken on the bone, skinned or thigh fillets",
    "Instructions": "1) Put the chicken into a large bowl and sprinkle with the chilli powder, turmeric, garam masala, ground coriander, black pepper, salt, lemon juice and stir to coat. Leave for 10 minutes.\n2) Heat 1 tbsp oil and add cumin seeds until they sizzle.\n3) Add the sliced onion and stir through until they start to colour and turn golden.\n4) Add the garlic and then stir in the ginger and all the chillies.\n5) Add the curry leaves then add the chicken pieces and coat with the mixture on a high heat to seal the meat.\n6) Reduce the heat to low add the two slices of lemon and place the lid on the pan. Leave to cook for about 20-40 minutes (depending on the meat you use).\n7) Stir every now and again until it’s cooked through and the chicken is coming away from the bone.\n8) Remove from the heat and squeeze in the lemon, sprinkle with coriander and serve.",
    "": ""
  },
  {
    "Dish Name": "Lemon Rice",
    "Description": "Nimbu Chaul",
    "Spice": "medium",
    "Prep Time": "Prep 30 mins",
    "Cook Time": "10 mins",
    "Ingredients": "1) 4 tbsp vegetable oil or 2tbsp coconut oil\n2) 1 tsp mustard seeds\n3) 7-10 curry leaves\n4) 3 green chillies\n5) 1 tsp salt\n6) ½ tsp turmeric\n7) 2 tbsp peanuts or cashew nuts\n8) 2 lemons\n9) 200g Basmati rice",
    "Instructions": "1) Wash the rice until the water runs clear.\n2) In a wide based pan add the washed rice, pour in 500ml of water (twice the amount of water to rice). Bring the water to a rolling boil, reduce the heat to the lowest setting and place the lid on the pan. Leave to cook for 12 minutes.\n3) Remove from the heat, very gently fork through it and leave to cool.\n4) In a separate pan heat the oil and add the mustard seeds. As they begin to splutter add the peanuts or cashews and fry to a golden brown colour. Add the turmeric powder, the curry leaves, green chillies and salt - fry for a minute.\n5) Remove from the heat and stir into the rice.\n6) Squeeze in the juice from the lemon and mix through carefully until all the rice is beautifully bright yellow.",
    "": ""
  },
  {
    "Dish Name": "Maacher Jhol",
    "Description": "Bengali Fish Curry",
    "Spice": "medium",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "30 mins",
    "Ingredients": "1) 4 large fish steaks (Kingfish, Salmon, Halibut)\n2) 1 tsp turmeric powder\n3) ½ tsp salt\n4) 3 tbsps mustard oil\n5) 10 minature potatoes\n6) 1 large bay leaf\n7) 5 green cardamom pods, bruised\n8) 1 tsp cumin seeds\n9) 1 tsp mustard seeds\n10) 1 large onion\n11) 5 cm ginger, crushed\n12) 3 garlic cloves, crushed\n13) 1 fresh chilli, finely chopped\n14) 2 tomatoes, finely chopped\n15) ½ tsp turmeric powder\n16) 1 tsp coriander seeds, crushed\n17) 2 tbsps Greek yogurt\n18) 2 green chillies, sliced lengthways\n19) handful of fresh, green coriander, finely chopped",
    "Instructions": "1) Wash the fish and pat dry with some kitchen paper. Place onto a dish and sprinkle with turmeric powder and salt. Rub this into the fish and set aside for 30 minutes.\n2) In the meantime blitz the onion to get a paste.\n3) When the fish has marinated, heat the mustard oil in a pan and fry the pieces of fish until each one is golden on both sides. Be gentle with the fish while it cooks then set to one side.\n4) Use the same oil or add more if required and fry the potatoes until they are golden. Drain on kitchen towel and set to one side.\n5) If needed add a little more oil and heat on medium heat. Add the bay leaf, cardamom pods and cumin seeds.\n6) Once fragrant add the onion paste with the crushed ginger and garlic and fry for about 10 minutes.\n7) Just as they turn golden in colour add the tomatoes, turmeric powder, crushed coriander seeds and chopped chillies.\n8) Stir until fragrant then spoon in the yogurt and mix well.\n9) Fry this for about 10 -15 minutes until it becomes shiny the add 1 or 2 cups of hot water.\n10) Stir in the fried potatoes and bring the sauce to a boil. Reduce the heat and leave the potatoes simmering to cook through.\n11) Once they are soft and cooked through add the fried pieces of fish and stir gently.\n12) Cook for a few minutes then remove from the heat and sprinkle with the chopped coriander leaves and sliced chillies to garnish. Serve immediately with some plain rice",
    "": ""
  },
  {
    "Dish Name": "Mackerel Fry",
    "Description": "Masala Fried Mackerel",
    "Spice": "medium",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "10 mins",
    "Ingredients": "1) 5 black peppercorns\n2) 1 tsp chilli powder\n3) 1 tsp cumin seeds\n4) 1 tsp coriander seeds\n5) ½ tsp turmeric\n6) salt to taste\n7) 1 lemon\n8) 3cm piece ginger, crushed\n9) 2 cloves garlic, crushed\n10) 2 whole mackeral\n11) 1 tsbp vegetable oil",
    "Instructions": "1) In a pestle and mortar crush the pepper, cumin, and coriander seeds and place into a bowl\n2) Then crush the ginger and garlic and add to the bowl as well.\n3) Mix in the chilli, turmeric, salt and juice from the lemon to make a paste.\n4) Put slits down the sides of the fish and smear the paste over the fish\n5) Cook the fish in a frying pan on a gentle heat for about 4-5 mins on each side\n6) Pour the oil over the fish at the end and it will crisp up and serve with a radish salad",
    "": ""
  },
  {
    "Dish Name": "Mango Kachumber",
    "Description": "Mango Salsa",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "",
    "Ingredients": "1) 1 red onion, very finely diced\n2) Handful fresh coriander leaves, chopped\n3) ½ red chilli, finely chopped\n4) Juice of one lime\n5) 1 large ripe mango, pitted and cubed\n6) ½ tsp kalongi seeds",
    "Instructions": "1) Finely dice the onion, mango.\n2) Chop the coriander and chilli.\n3) Combine the onion, coriander and chilli in a bowl\n4) Add the lime juice, mango cubes and kalongi seeds.\n5) Leave to stand for 10 minutes and stir before serving.",
    "": ""
  },
  {
    "Dish Name": "Mango Lassi",
    "Description": "Frozen Mango Yoghurt Drink",
    "Spice": "none",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "",
    "Ingredients": "1) 1 mango, peeled, stoned and chopped\n2) 4 tbsp Greek yoghurt\n3) Splash of cold milk\n4) 3 tsp of sugar (or to taste)\n5) 1 handful of ice cubes\n6) Sprinkle of cardamom powder",
    "Instructions": "1) Put the yoghurt, milk, mango, sugar, ice into a blender and blitz until smooth.\n2) Pour the mixture into a tumbler and sprinkle with some cardamom powder.",
    "": ""
  },
  {
    "Dish Name": "Marrow Curry",
    "Description": "40 mins",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "30 mins",
    "Ingredients": "1) 1 tbsp rapeseed oil\n2) 1 tsp cumin seeds\n3) 1 tsp mustard seeds\n4) 1 large onion, peeled and chopped\n5) 2-3 garlic cloves, peeled\n6) 200g tin plum tomatoes\n7) 1 tbsp of fresh ginger, grated\n8) 1-2 green chillies, chopped\n9) ½ tsp turmeric\n10) ½ tsp chilli powder\n11) 1 tsp salt\n12) 1 large marrow (approx 1-1.5kg)\n13) 1 tsp garam masala\n14) handful fresh coriander",
    "Instructions": "1) Heat oil and add the cumin and mustard seeds. Once they sizzle and become fragrant add the onions. Fry for about 6-7 minutes until they become translucent and just golden brown.\n2) Add the garlic and cook on a gentle heat for a few minutes. In the meantime, wash and chop the marrow into 3-4cm chunks. If your marrow is an older marrow then you may also need to peel it as the skin can be tough. You may also need to remove the seeds and soft central part of the marrow.\n3) Add the tomatoes to the pan and stir in the grated ginger, chilli powder, turmeric, salt, and green chilli. Stir for a few minutes until the masala in thick and shiny.\n4) Add the chopped marrow and bring the pan to a simmer. Cover, then turn the heat to low and cook for about 20-30 minutes. Do check and stir occasionally.\n5) When the marrow has cooked to the texture you like, remove from the heat and add the garam masala and coriander to serve.",
    "": ""
  },
  {
    "Dish Name": "Masala Dosa",
    "Description": "Crisp Lentil Pancakes",
    "Spice": "medium",
    "Prep Time": "Prep 2 days",
    "Cook Time": "10 mins",
    "Ingredients": "1) 190g rice\n2) 105g white lentils (split urid with skin removed)\n3) 20g split chana lentils\n4) 1 tsp fenugreek seeds\n5) 1 tbsp oil\n6) 1 tsp salt",
    "Instructions": "1) Wash and soak the lentils, rice & fenugreek seeds in enough cold water to cover the mixture by about an inch.\n2) Leave at room temperature for a minimum of 6 hours or overnight.\n3) Blend the lentils and rice with some of the water to create a grainy batter. It should be of a pouring consistency with a slightly rough texture. Empty the batter into a bowl and leave to ferment overnight at room temperature (not too cold).",
    "": ""
  },
  {
    "Dish Name": "Masala Gosht",
    "Description": "Lamb Chop Curry",
    "Spice": "medium",
    "Prep Time": "Prep 15 mins",
    "Cook Time": "1 hr",
    "Ingredients": "1) 1 tbsp rapeseed oil\n2) 800g-1kg lamb chops, trimmed\n3) 2 large onions, peeled and roughly diced\n4) 3cm piece ginger, grated\n5) 6 cloves garlic, peeled\n6) 1 tsp chilli powder\n7) 1 tsp turmeric\n8) 1 heaped tsp cumin seeds, crushed\n9) 2 tsp coriander seeds, crushed\n10) 2 tsp Kasoori methi\n11) 1 tsp salt (or to taste)\n12) 200g plum tomatoes\n13) 145ml Greek yoghurt, beaten\n14) Large handful fresh coriander, chopped\n15) 1 tsp garam masala\n16) 2 green chillies, sliced",
    "Instructions": "1) Blitz the onions in a blender.\n2) Heat the oil in a large pan and add the onions, cook on a high heat for about 5 minutes.\n3) Reduce the heat and leave to cook until the onions start to brown. If they catch on the bottom of the pan, add a little water and continue to cook for about 20 minutes.\n4) In a blender blitz the ginger, garlic and green chillies and add to the pan once the onions have browned. Stir and cook for a further 5-6 minutes until the garlic is cooked.\n5) Place the chops into the pan and sear both sides before reducing the heat.\n6) Blend the tomatoes with a stick blender until smooth and add to the pan\n7) Crush the coriander and cumin seeds in a pestle and mortar and stir into the pan along with the turmeric, red chilli powder, Kasoori methi and salt.\n8) Turn up the heat to bring everything up to a simmer, and then reduce the heat.\n9) Place the lid on the pan and leave to simmer gently for 30 minutes.\n10) Beat the Greek yoghurt and add a table spoon at a time, mixing in between each spoonful to ensure it is fully absorbed. Leave to cook for a further 20–30 minutes until the meat is tender.\n11) Add a little hot water if you want more of a gravy, and then stir in the garam masala and top with fresh coriander to serve.",
    "": ""
  },
  {
    "Dish Name": "Melon Soup with a hint of Chilli",
    "Description": "Spiced Melon Soup",
    "Spice": "none",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "",
    "Ingredients": "1) 1 melon\n2) 2 green chillies very finely chopped\n3) squeeze of lemon\n4) salt to taste\n5) pinch of cumin seeds, toasted and crushed",
    "Instructions": "1) Cut open a melon and remove the seeds and remove the flesh from the skin.\n2) Place in a blender and blitz.\n3) Pour through a sieve to remove all the fibers.\n4) Add the chopped chilli to the sieved melon, mix and leave to infuse for and hour or so.\n5) When you are ready to serve, add a little salt and a squeeze of lemon and stir then sieve again.\n6) Pour into small bowls or little glasses to serve and top with some roasted cumin seeds.",
    "": ""
  },
  {
    "Dish Name": "Mint and Coriander Chutney",
    "Description": "Pudina Thania Chutney",
    "Spice": "medium",
    "Prep Time": "",
    "Cook Time": "",
    "Ingredients": "1) 30g fresh mint leaves\n2) 30g fresh coriander leaves\n3) 1 green chilli ( add more chillies if you want the chutney to be spicy)\n4) ½ inch ginger, roughly chopped\n5) salt to taste",
    "Instructions": "1) In a blender grind all the ingredients to a smooth paste using little water.\n2) Store in an airtight container in the refrigerator until required.",
    "": ""
  },
  {
    "Dish Name": "Mint and Coriander Dip",
    "Description": "Coriander and Mint Raita",
    "Spice": "mild",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "5 mins",
    "Ingredients": "1) 50g of mint leaves\n2) 50g of coriander leaves\n3) 1 fresh chilli\n4) ½ tsp salt\n5) 3 tbsp Greek style yoghurt\n6) ½ tsp garam masala\n7) sprinkle of chilli powder",
    "Instructions": "1) Put the chilli, mint, coriander and salt into a blender and whizz together to make a smooth paste (you may need to add a dash of water too).\n2) Place into to a bowl and stir in the yoghurt and garam masala.\n3) Sprinkle over the chilli power and serve straight away.",
    "": ""
  },
  {
    "Dish Name": "Mint Chutney",
    "Description": "Pudina Chutney",
    "Spice": "hot",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "5 mins",
    "Ingredients": "1) Large bunch of fresh mint leaves\n2) 1 onion cut into chunks\n3) 1 tsp salt\n4) 1 green chilli (add more for more heat)\n5) 1 or 2 lemons",
    "Instructions": "1) Slice the lemon in half and slice off the rind, remove any pips and chop the flesh into quarters.\n2) Remove the leaves from the mint, discarding the stalks and remove the chilli stems too.\n3) Place the mint, lemon, salt, chillies and onion into a blender and blitz until you get a fine blended chutney.",
    "": ""
  },
  {
    "Dish Name": "Mint Lassi",
    "Description": "Salted Mint Yoghurt drink",
    "Spice": "none",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "",
    "Ingredients": "1) 500ml Greek yoghurt\n2) water\n3) Handful fresh mint leaves\n4) 1 tsp black salt\n5) 1 tsp roasted cumin seeds\n6) mint leaves to garnish\n7) ice cubes",
    "Instructions": "1) Put the yoghurt, mint, a splash of water into a blender and blitz to make a smooth drink. add more water if required.\n2) Roast the cumin seeds in a pan and grind to a powder in a pestle and mortar.\n3) Add half the salt and the roasted cumin powder to the yoghurt mixture.\n4) Blend again and check the seasoning and add a little more salt if required.\n5) Put the ice cubes into the glasses and pour the lassi over them, top with a couple of mint leaves.",
    "": ""
  },
  {
    "Dish Name": "Mint Raita",
    "Description": "Quick Mint Yoghurt Sauce",
    "Spice": "",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "5 mins",
    "Ingredients": "1) 100ml natural set yoghurt\n2) Splash of milk\n3) 1 tbsp mint sauce\n4) 1 tsp garam masala",
    "Instructions": "1) Put the yoghurt into a bowl, add a splash of milk to create a runny consistency.\n2) Stir in the mint sauce.\n3) Stir in the garam masala.\n4) Garnish with a sprig of mint and refrigerate until required.",
    "": ""
  },
  {
    "Dish Name": "Missi Roti",
    "Description": "Unleavened Spiced Flat Bread",
    "Spice": "mild",
    "Prep Time": "Prep 30 mins",
    "Cook Time": "5 mins",
    "Ingredients": "1) 120g gram flour\n2) 120g atta (whole wheat Flour)\n3) 1 onion, finely chopped\n4) 1 green chilli, finely chopped\n5) 2 tbsp yoghurt\n6) ¼ tsp carom Seeds (ajwain)\n7) ¼ tsp turmeric\n8) ½ tsp Kashmiri chilli powder\n9) 1 tsp garam masala\n10) ¼ tsp amchoor powder (dry mango powder)\n11) 2 tbsp methi leaves (fenugreek leaves - fresh or dried)\n12) 2 tbsp chopped coriander leaves\n13) 2 tsp ghee or rapeseed oil\n14) Salt to taste\n15) water or milk (if required)",
    "Instructions": "1) Add everything into mixing bowl apart from the milk or water - gram flour, whole-wheat flour, finely chopped onion, chopped green chilli, carom seeds, yoghurt, dry mango powder, turmeric, red chilli powder, garam masala, 2 tsp ghee or oil and salt.\n2) Mix all ingredients with your hand then add water or milk a little at a time if needed. Knead the dough to a smooth and soft mixture. Cover it with a tea towel and set to one side for 10 minutes. The dough will be a little more sticky compared to just a flour dough.\n3) Grease the dough with a little oil and knead it again.\n4) Put a little oil on your hands and divide it into 8 equal portions. Roll them into balls and set to one side.\n5) Heat a tava, griddle or frying pan over medium heat.\n6) Ensure you have some flour on a plate for dusting then take one ball and flatten it out in the dusting flour on both side.\n7) Using a rolling pin, start to roll out the dough into a thick round roti (approx 5-6 inch diameter). You don't want these to be too thin.\n8) Once the tava has warmed up place one roti and let it begin to cook. Tiny bubbles will starts to rise on top surface. Flip it and reduce flame to low.\n9) Spread a little ghee on the surface using a spoon and continue to cook for about a minute.\n10) Flip it over and increase the heat, spread a little more ghee on this side and cook for about 30 seconds.\n11) Flip again and cook until it's golden and brown spots appear evenly on both the sides. You may need to flip it a couple more times.\n12) Place the cooked roti on a plate lined with kitchen roll. Repeat with the remaining balls of dough and serve immediately.",
    "": ""
  },
  {
    "Dish Name": "Monkfish Curry",
    "Description": "35 mins",
    "Spice": "mild",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "30 mins",
    "Ingredients": "1) 800g of monkfish fillet, cut into cubes\n2) 4 tomatoes, roughly chopped\n3) 200ml of hot water\n4) 1 tbsp coconut oil\n5) ½ tsp of black or brown mustard seeds\n6) ½ tsp of fenugreek seeds\n7) 10 fresh curry leaves or 15 dried\n8) 1 inch piece ginger, cut into julienne\n9) 1 onion, finely sliced\n10) 3-4 green chillies, sliced\n11) ½ tsp turmeric\n12) 1 tsp cumin seeds\n13) 3 tsp of coriander seeds\n14) 1 tsp of Kashmiri chilli powder\n15) 100ml of coconut milk\n16) 1 tsp salt\n17) 1 lime",
    "Instructions": "1) Wash the monkfish cubes and leave to drain.\n2) In a blender, pulse the tomatoes into a purée with 200ml of water and set aside.\n3) Slice the ginger, chillies and onions.\n4) Heat 1 tbsp of coconut oil over a medium heat, then add in the mustard seeds.\n5) Once they are crackling, stir in the fenugreek seeds followed by the curry leaves.\n6) Dont let the fenugreek seeds colour then add the ginger, sliced onions and chillies. Stir and leave to cook until the onions are golden brown (10 minutes).\n7) Stir in the puréed tomatoes and increase the heat.\n8) Crush the cumin and coriander seeds in a pestle and mortar and add to the sauce with the turmeric and chilli powder.\n9) Partially cover the pan and turn up the heat so that it starts to boil, leave the tomatoes to reduce and thicken for about 10-20 minutes.\n10) Turn down the heat and pour in the coconut milk and salt to taste. Bring the curry back to the boil and reduce to a simmer.\n11) Place in the pieces of fish and allow it to cook for about 2-3 minutes until the fish is just cooked through, then remove from the heat.\n12) Squeeze in the juice of lime and check the seasoning. Serve immediately with some plain Basmati rice.",
    "": ""
  },
  {
    "Dish Name": "Moong Masoor di Dhal",
    "Description": "Red lentil and split mung lentil dhal",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "20 mins",
    "Ingredients": "1) 100g of split red lentils washed\n2) 100g split mung beans washed\n3) 900ml water 1 tsp salt",
    "Instructions": "1) Place the red lentils in a pan with the salt, cover with the water and bring to the boil.\n2) Remove the froth and add the split mung beans.\n3) Reduce the heat and put the lid on the pan - leave to simmer for 15 minutes.\n4) Check the lentils are cooked by squeezing them between your fingers. Once soft remove from the heat.\n5) In a frying pan heat the oil or butter.\n6) Using a fork pierce the red chillis and add to the pan with a bay leaf and the cumin seeds. When the seeds sizzle, remove the chilli and set to one side for your garnish.\n7) Add the onion and garlic and fry until lightly browned.\n8) Reduce the heat and add the tomatoes, ginger, turmeric, and the chopped chilli. Gently let the ingredients cook down to make a thick dry paste (10 mins).\n9) Add a ladle full of the cooked lentils (dhal) to the masala paste in the frying pan and stir together, then empty all the contents back into the pan with the lentils and stir.\n10) It should have the consistency of a thick soup but if it's too thick just add a little boiling water and remove from the heat.\n11) Stir in the garam masala, coriander and top with the whole chillis to serve.",
    "": ""
  },
  {
    "Dish Name": "Morel Mushroom Pilau",
    "Description": "Kashmiri Gucchi Pilau",
    "Spice": "none",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "20 mins",
    "Ingredients": "1) 300g white basmati rice\n2) ¼ tsp saffron strands\n3) 1 tsp screw pine water (or 1 tbsp rosewater, or jasmine flower water)\n4) 150g fresh morel mushrooms\n5) 75g ghee or 3-4 tbsp rapeseed oil\n6) ½ onion, sliced\n7) 3cm ginger, sliced into thin strands\n8) 4 black cardamoms, lightly crushed\n9) 6 green cardamoms, lightly crushed\n10) 10cm piece cassia bark, broken\n11) 6 cloves\n12) 3 dried bay leaves\n13) 75g almond slivers\n14) 1 tsp salt\n15) ¾ litres cold water\n16) 1 tsp garam masala\n17) fresh coriander leaves, chopped",
    "Instructions": "1) Wash the rice in several changes of cold water until the water runs clear and set to one side.\n2) Soak the saffron strands in the screwpine water or flaower water and leave for later.\n3) Rinse the mushrooms and cut them in half lengthways.\n4) Heat the ghee or oil in a wide heavy-bottomed saucepan and add the whole spices with the bay leaves. Stir for a few minutes until you can smell the fragrance from the spices.\n5) Stir in the sliced onions and cook for about 5 minutes before adding the ginger.\n6) Next add the prepared mushrooms and almonds, and sauté for a couple of minutes until the nuts begin to brown.\n7) Add the washed rice to the mushroom mixture and sauté for a few minutes until the grains of rice become shiny.\n8) Pour in the saffron mixture and salt. Add the cold water and bring the rice to the boil.\n9) Reduce the heat to the lowest setting and cover with a lid. Let the rice cook undisturbed for 15 minutes.\n10) Check to see whether the rice is cooked by pressing a couple of grains between your fingers. Remove from heat and set aside.\n11) Sprinkle the rice with garam masala and coriander leaves just before serving.",
    "": ""
  },
  {
    "Dish Name": "Mushy Pea Curry",
    "Description": "Muttar Masala",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "20 mins",
    "Ingredients": "1) 300g fresh tomatoes, roughly chopped\n2) 1 small onion, roughly chopped\n3) 150g fresh coconut\n4) 5 cloves of garlic\n5) 2 cm ginger, roughly chopped\n6) 3 fresh green chillies (amend to personal taste)\n7) 2 tbsp oil\n8) 1 tsp cumin seeds\n9) ½ tsp turmeric\n10) ½ tsp red chilli powder\n11) 400g tin marrow fat peas or frozen peas\n12) Salt to taste\n13) 1 tsp coriander, chopped",
    "Instructions": "1) To make the masala, blend the tomatoes, onion, coconut, garlic, green chillies and ginger to a paste with 200ml of water.\n2) Heat oil in a pan and add the cumin seeds until fragrant.\n3) Pour the blended mixture into the pan and cook for about 10 minutes.\n4) Add in the turmeric and chilli powder and stir. Leave this to cook so it thickens and the starts to make a masala.\n5) Stir in the green peas with about 50ml of water and stir.\n6) Continue to cook until the peas are soft and cooked through. Taste and adjust the season if required.\n7) Sprinkle with some fresh coriander to serve with some rice.",
    "": ""
  },
  {
    "Dish Name": "Paapri Chaat",
    "Description": "Chickpea chaat",
    "Spice": "medium",
    "Prep Time": "Prep 40 mins",
    "Cook Time": "15 mins",
    "Ingredients": "1) 200g plain flour\n2) 40g oil\n3) salt, to taste\n4) 1 tbsp ajwain seeds\n5) Vegetable oil for frying",
    "Instructions": "1) Add the flour to a bowl and mix in the salt and ajwain.\n2) Add the oil and start to knead to form a dough.\n3) Make small balls with the dough slightly bigger than the size of a gooseberry.\n4) Roll them out so they are about 4-5 cm in diameter.\n5) Place a large, deep pan or a wok on a gentle heat and pour in the vegetable oil and allow it to get hot.\n6) To test if it's hot enough, drop a tiny piece of dough into the pan – if it floats to the surface and starts to sizzle, it's ready.\n7) Very gently slide in one circle of dough and fry for 2 to 3 minutes. Then using your spoon to push them under the oil, then carefully flip them over and continue cooking for 1 minute, until it's golden and crisp. Transfer to a kitchen paper to drain, and repeat with the remaining dough.",
    "": ""
  },
  {
    "Dish Name": "Papad",
    "Description": "Poppadoms",
    "Spice": "mild",
    "Prep Time": "Prep 1 hr 30 mins",
    "Cook Time": "5 mins",
    "Ingredients": "1) 4oz Urid flour\n2) 2oz rice flour\n3) ½ tsp turmeric powder\n4) ½ tps pink rock salt\n5) 2 tsp coconut oil\n6) 40ml water",
    "Instructions": "1) Put the flours, turmeric and rock salt into a bowl and mix. (You can also add spices at this stage cumin, ground black pepper, ajwain, garlic powder, chilli flakes are all good.)\n2) Add the coconut oil and add the water a little at a time and stir to make a stiff dough. Knead until it's smooth.\n3) Wrap the dough in cling film and let it sit for an hour.\n4) Split the dough into 6 equal sized balls and roll out to 1mm thickness. You will need to use flour to dust your surface.\n5) Place the rolled out poppadoms on some kitchen roll to dry for 20 minutes. You can also leave them in the sun to dehydrate and store them in an airtight container at this stage.\n6) Heat oil in a wok drop in a little of the dough if it sinks and rises then the oil is ready.\n7) Gentle place one poppadom into the oil and push under the oil until it bubbles and turns golden. Remove and set on some kitchen roll. Repeat with the remaining popadoms.",
    "": ""
  },
  {
    "Dish Name": "Patra Ni Machi",
    "Description": "Fish with Green Chutney",
    "Spice": "medium",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "30 mins",
    "Ingredients": "1) 4 seabass or pomfret steaks\n2) 100g fresh coconut, grated\n3) 3 green chillies\n4) 50g coriander, washed\n5) 50g mint leaves, washed\n6) 4cm piece of ginger\n7) 3 garlic cloves\n8) ½ tsp cumin powder\n9) ¼ tsp turmeric powder\n10) ½ tsp salt\n11) 1 lemon\n12) 1 large banana leaf washed thoroughly, central spine removed\n13) 1 tbsp vegetable oil",
    "Instructions": "1) Put the fish steaks on a tray and squeeze the lemon over them with a sprinkle of salt and turmeric.\n2) Rub this over the fish and set to one side for 20 minutes.\n3) Crush the cumin seeds. Put the coconut, green chillies, coriander and mint leaves, ginger and garlic, a little salt and the crushed cumin into a blender and grind to a smooth paste. And a dash of water if required.\n4) Coat the pieces of fish all over and keep aside.\n5) Pat dry the banana leaf pieces and smear lightly with a little oil on the smooth side.\n6) Place one piece of fish in the center of each piece of leaf and wrap into a neat parcel. Tie with twine from the leaf or with a toothpick.\n7) This can either be griddled or cooked in a steamer for 15 minutes. Serve it all wrapped up with a some rice.",
    "": ""
  },
  {
    "Dish Name": "Pea and Ham Soup with Chilli and Cumin",
    "Description": "Spiced Ham and Pea Soup",
    "Spice": "mild",
    "Prep Time": "Prep 12 hrs",
    "Cook Time": "5 hrs",
    "Ingredients": "1) 1 ham knuckle, or cured ham hock\n2) 1 celery stick, roughlt chopped\n3) 1 onion, roughly chopped\n4) 1 carrot, roughly chopped\n5) 1 bay leaf",
    "Instructions": "1) Soak the ham hock in water overnight. Discard the water.\n2) Put it into a deep pan and cover completely with fresh cold water. Bring to the boil then simmer gently. You may need to skim the surface of the liquid.\n3) Add the celery stick, onion, carrot and bay leaf to the ham.\n4) Cook this for 2 hours and 30 minutes. Top with more water as and when required.\n5) Remove the ham from the water and leave it to cool. Strain the cooking liquid through a sieve and save 2L to use as the stock for the soup. I usually freeze the extra stock.\n6) Chop the onion and celery so it's nice and fine (you can use a blender).\n7) Heat a large pan and add the butter.\n8) Add 1tsp of cumin seeds until fragrant and then add the celery and onion mixture.\n9) Sweat for 4–5 minutes and add the garlic and chopped green chilli. Stir for a minute or two but do not let it colour.\n10) Add the green split peas and stir through for another 2–3 minutes.\n11) Pour in the strained ham stock and another bay leaf and a twist of black pepper.\n12) Bring it to the boil, then leave to simmer for 2 hours and 30 minutes until the peas are fully cooked through. I also like to add a handful of frozen green peas halfway through.\n13) Blitz with a hand blender to create a smooth soup.\n14) Once the ham has cooled shred the meat and mix it into the soup. Save some to sprinkle on top when serving too.",
    "": ""
  },
  {
    "Dish Name": "Pilchard Curry",
    "Description": "Fish Curry from a Can",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "20 mins",
    "Ingredients": "1) 2 x 425g tin of pilchard in tomato sauce\n2) 1 tbsp oil\n3) 1 onion, sliced\n4) ½ tsp carom seeds\n5) 2 cloves of garlic, sliced\n6) 2 tsp ginger, grated\n7) 1 chilli, chopped\n8) 1 tsp salt\n9) 1 tsp turmeric\n10) 1 tsp dried fenugreek leaves (kasoori methi)\n11) Handful of fresh coriander, chopped",
    "Instructions": "1) Heat oil in a pan and add carom seeds. When the carom seeds start to sizzle add the sliced onion and garlic then fry until lightly brown.\n2) Reduce the heat and add ginger, chilli, turmeric, salt, fenugreek and fry until aromatic (about 5 mins). If the spices stick just add a dash of water to loosen.\n3) Open the tin of pilchards and pour in the tomato juice keeping the fish behind.\n4) Cook everything to create a thick masala paste which becomes nice and shiny.\n5) Gently place the fish into the masala and heat. Be careful not to stir as you don't want the fish to break up. If it looks a little dry, add some hot water.\n6) Remove from the heat and add garam masala and a good pinch of coriander to serve.",
    "": ""
  },
  {
    "Dish Name": "Pineapple Curry",
    "Description": "Pineapple Curry",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "30 mins",
    "Ingredients": "1) 1 Pineapple, peeled, cored and diced\n2) 1 tbsp coconut oil\n3) 1 tsp mustard seeds\n4) 4 cardamoms\n5) 2cm piece cassia bark\n6) 1 onion, diced\n7) 4 garlic cloves, minced\n8) 3cm piece fresh ginger, grated\n9) 1 red chilli, sliced\n10) 1 tsp turmeric\n11) 1 tsp lemon pepper, crushed (or just black pepper)\n12) ½ tsp chilli powder\n13) ½ tsp salt, or to taste\n14) 400ml coconut milk",
    "Instructions": "1) Heat the coconut oil and add the mustard, cardamom and cassia bark until the seeds pop.\n2) Add the diced onion and stir though until translucent\n3) Add the garlic and stir to cook for about 5 minutes.\n4) As the onions just start to brown add the ginger, chilli, turmeric, pepper, chilli powder and stir.\n5) Add the pineapple pieces and coat with the masala spices.\n6) Pour in the coconut milk and turn up the temperature to bring to a simmer.\n7) Put the lid on and leave it to simmer gently for 30 minutes or until you are happy with how much the pineapple has softened - I preferred mine soft.",
    "": ""
  },
  {
    "Dish Name": "Piri Piri Sauce",
    "Description": "Hot Pepper Sauce",
    "Spice": "hot",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "10 mins",
    "Ingredients": "1) 5-10 fresh red chillies, depending on how hot you want it\n2) 2 dried smoked red chillies\n3) 2 garlic cloves, roughly chopped\n4) 1 tsp rock salt\n5) ½ tsp oregano\n6) ½ tbsp smoked paprika\n7) 150ml olive oil\n8) 100ml red wine vinegar",
    "Instructions": "1) Preheat the oven to 180°C and put all the chillies onto a roasting tray and roast them for 10 minutes.\n2) Roughly chop the garlic and blanch in hot water for about 4 minutes.\n3) Once roasted let the chillies cool and roughly chop them (use gloves and then wash your hands afterwards).\n4) Place the chillies, blanched garlic, salt, oregano, paprika, olive oil and vinegar into a small saucepan, and bring to the boil then leave to simmer for about 2-3 minutes.\n5) Once the mixture has cooled blend everything so it's the consistency of a fine pouring sauce. Store in a tight jar at room temperature. It will keep for about a month. Shake before using.",
    "": ""
  },
  {
    "Dish Name": "Pitta Bread with Carom Seeds",
    "Description": "Middle Eastern Bread",
    "Spice": "none",
    "Prep Time": "Prep 20 mins",
    "Cook Time": "5 mins",
    "Ingredients": "1) 250g brown flour\n2) 1 tsp ajwain (carom seeds)\n3) 1 tsp salt\n4) 7g instant yeast\n5) 2 tsp rapeseed oil\n6) 160ml water\n7) Extra flour for dusting",
    "Instructions": "1) Tip the flour into the mixing bowl of your stand mixer with the dough hook attached and add the ajwain, salt to one side and the yeast to the other.\n2) Add the oil and 120ml of the water and start to mix. Add the remaining water a little at a time until you have a soft, sticky dough (you may not need all the water).\n3) With a little oil knead the dough for 5-10 minutes. The dough will become less sticky and start to feel smooth.\n4) Lightly oil a bowl and place the dough in the bowl, cover and leave in a warm room until it doubles in size approx. 1-2 hours.\n5) Heat the oven to 220ºC, and place a baking tray in the centre to heat up. You can also use a baking stone if you have one.\n6) Dust your worktop with flour and knock back the dough and kneed for a few mintues until it's soft.\n7) Divide it into 6 equal portions and then shape each one into a ball. Flatten with your fingertips and start to roll it out into an oval shape that's about 1cm thick.\n8) Take the hot tray out of the oven, dust with flour and lay the pittas on it.\n9) Bake for 5- 10 minutes until they puff up and just start to brown.\n10) Immediatly, wrap them in a clean tea towel. This traps in the steam and keeps them lovely and soft, and leave to cool.",
    "": ""
  },
  {
    "Dish Name": "Plain Basmati Rice",
    "Description": "Chaul",
    "Spice": "mild",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "15 mins",
    "Ingredients": "1) 1 mug of washed basmati rice\n2) 2 mugs of cold water",
    "Instructions": "1) Wash the rice till the water runs clear - this is done by putting the rice in a pan stirring and draining, repeat and wash again until the water is clear. You will need to do this a few times. I always measure my rice in a mug (a standard mug will feed 3-4 people) and you will need twice the amount of water to rice to cook them perfectly.\n2) Put your washed rice in a wide based pan and add twice the amount of cold water.\n3) Begin to heat up the pan and bring it to a rolling boiling. Reduce the heat to the lowest setting possible and put the lid on the pan. Leave to cook for exactly 12 minutes. However tempted you maybe do not remove the lid.\n4) After 12 minutes remove from the heat, take the lid off and leave for a few minutes.\n5) All the water will have been absorbed and each grain will be separate - using a fork gently fluff up the rice don't just plunge straight in with a spoon",
    "": ""
  },
  {
    "Dish Name": "Pomegranate Raita",
    "Description": "10 mins",
    "Spice": "none",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "",
    "Ingredients": "1) 250g plan Greek yoghurt\n2) ½ tsp roasted cumin\n3) 1 tsp jaggery (or brown sugar)\n4) 2 tbsp pomegranate seeds\n5) 2 tbsp grated cucumber\n6) ½ tsp salt",
    "Instructions": "1) Put the yoghurt into a bowl and beat it a little to aerate.\n2) Toast the cumin seeds in a frying pan until fragrant then add to the yoghurt.\n3) Mix all the other ingredients and stir through",
    "": ""
  },
  {
    "Dish Name": "Power Salad Jar",
    "Description": "Spiced Salad Jar",
    "Spice": "mild",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "30 mins",
    "Ingredients": "1) 100g wild rice, cooked\n2) 1 tbsp rapeseed oil\n3) 1 small onion\n4) 1 tsp mustard seeds\n5) 1 tsp cumin seeds\n6) 2 cloves garlic\n7) 2 chicken breasts, sliced (you can use cooked chicken too)\n8) 1 tsp salt\n9) 1 tsp turmeric\n10) ½ tsp Kashmiri chilli powder\n11) 3 cm ginger, grated\n12) 1 green chilli finely chopped",
    "Instructions": "1) Heat the oven to 180ºC\n2) Coat the diced butternut squash in a little oil and a sprinkle of cumin seeds and chilli.\n3) Bake for 25 minutes until soft and charred. Remove and cool.\n4) At the same time coat the kale in a sprinkle of oil with some cumin and cook in the oven for 10 minutes until crisp – do not let it brown too much.Remove and leave to cool.\n5) Cook the rice as per the instructions on the pack.\n6) Heat oil in a pan and add the mustard and cumin seeds until they sizzle and become fragrant.\n7) Add the onion and cook until translucent and add the garlic. Sauté for 3-4 minutes.\n8) Add the sliced chicken and stir for 3-4 minutes.\n9) Add the salt, turmeric and chilli powder with the ginger and chilli and continue to cook. You can add a little splash of water if it feels too dry. Once the chicken is cooked through (about 5-6 minutes), remove from the heat and check the seasoning. Stir in the cooked rice. Leave to cool.\n10) Toast the walnuts in a dry frying pan for about 3-4 minutes, until golden. Cool, then roughly crush in a pestle and mortar.\n11) Heat a griddle and sear the avocado slices until charred.\n12) Build your salad with the butternut squash, chicken mixture, the griddled avocado, the crispy kale and sprinkle over the crushed toasted walnuts.\n13) Mix together all the dressing ingredients in a jar and pour over the salad.",
    "": ""
  },
  {
    "Dish Name": "Pumpkin Curry Recipe",
    "Description": "Hot and sour pumpkin curry",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "20 mins",
    "Ingredients": "1) 500g pumpkin peeled and chopped into cubes,\n2) 1 tbsp vegetable oil,\n3) ½ tsp fenugreek seeds,\n4) 1 dried chilli (optional)\n5) 1 tsp cumin seeds,\n6) 1 tsp chilli powder,\n7) 1 tsp turmeric,\n8) 1 tsp coriander seeds, crushed\n9) 1 green chilli, chopped\n10) 1 tsp salt\n11) 1 tsp sugar (optional)\n12) 1 green chilli, sliced (optional)\n13) 2 tsp amchoor or 1 tbsp tamarind water\n14) Handful of fresh coriander",
    "Instructions": "1) Heat oil on a gentle heat and add the cumin and fenugreek seeds and 1 dried chilli until they splutter.\n2) Reduce the heat and add chilli powder, turmeric, coriander and fry for five minutes.\n3) Stir in the fresh green chillies, pumpkin, salt and sugar (optional).\n4) Cover and cook for 20 minutes until soft, stirring occasionally.\n5) If there is a lot of moisture in the dish, increase the heat and stir until the consistency is thick and lovely.\n6) Remove from the heat and add the split chillies and amchoor or tamarind. If using a block of tamarind take a 5cm piece and rehydrate in approx. 100ml of boiling water. Sieve, discard the solids and use the water. Stir to absorb.\n7) Garnish with a handful of coriander.",
    "": ""
  },
  {
    "Dish Name": "Punjabi Piyaz",
    "Description": "Punjabi Onion Salad",
    "Spice": "hot",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "",
    "Ingredients": "1) 2 red onions, finely sliced in rings\n2) large pinch of fresh coriander, chopped\n3) 1 green chilli, chopped\n4) 1 lemon\n5) 1 tsp Kashmiri chilli powder\n6) salt to taste\n7) chaat masala (optional)",
    "Instructions": "1) Place the sliced onions in a bowl\n2) Add the chopped coriander and chopped chilli.\n3) Squeeze in the juice from the lemon\n4) Add the chilli powder, salt and chaat masala if using\n5) Using your hands mix everything together and serve",
    "": ""
  },
  {
    "Dish Name": "Punjabi Style Stuffed Karela",
    "Description": "Stuffed Bitter Gourd",
    "Spice": "medium",
    "Prep Time": "Prep 20 mins",
    "Cook Time": "40 mins",
    "Ingredients": "1) 6 bitter gourds (karela)\n2) 1 tsp cumin seeds, crushed\n3) 1 large onion, finely chopped\n4) 3 tbsp mustard oil\n5) 4 cloves garlic, finely chopped\n6) 3 cm piece ginger, finely chopped\n7) 1 tsp salt\n8) 2 chillies, chopped\n9) 1 tsp turmeric\n10) 1 tsp amchoor\n11) 1 tsp coriander seeds,crushed\n12) 1 tsp fennel seeds, crushed\n13)",
    "Instructions": "1) Prepare the karela by washing and drying them then using a peeler peel off the bumpy green skin and keep in a bowl.\n2) Slice open the tummy of each karela without going all the way through and scrape out the inside including the seeds using a teaspoon into the same bowl. This will make the stuffing.\n3) Heat mustard oil in a cast iron pan and add the cumin seeds, as these sizzle and become fragrant stir in the onions and fry until translucent\n4) Add the ginger and garlic and then the stuffing. Fry until the onions are golden brown (5-10 minutes). This is very important as the seeds will crisp up.\n5) Once browned stir in the amchoor, fennel, coriander, chilli, salt and turmeric. Fry for a few seconds and remove from the heat.\n6) Once cooled use a spoon or your hands and stuff the skins with equal amounts of the mixture. Hands are better as you will also cover the outside with the juices and oils from the stuffing as well.\n7) Press the stuffing into the skins. You can use a little cotton thread to wrap around each one to help hold their stuffing in.\n8) To cook the Karela you can either fry them or bake them. So either place the karela back into the pan with a little oil and cook them evenly until they turn a golden brown colour all over. Or place onto an oven tray and cook in the oven for 30 minutes until soft and browned all over. These are delicious served with a red lentil dhal, plain yoghurt and roti. Once cooked the karela will keep refrigerated for up to a week.",
    "": ""
  },
  {
    "Dish Name": "Punjabi Tomato Relish",
    "Description": "1 hr 10 mins",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "1 hr",
    "Ingredients": "1) 1 fresh tomato, roughly chopped\n2) handful of coriander, roughly chopped\n3) 3cm fresh ginger\n4) 1 tsp salt\n5) ½ tsp Kashmiri chilli powder, (optional)\n6) 1 tbsp vegetable oil\n7) 1 tsp kalonji seeds\n8) 1 tsp fennel seeds\n9) 1 tsp mustard seeds\n10) 1 tsp cumin seeds\n11) 1 tsp fenugreek leaves",
    "Instructions": "1) Place tomato, coriander, ginger into a blender and blitz to a pulp.\n2) Heat the oil in a heavy pan and add all the spices until they sizzle & become fragrant. This should only take a minute.\n3) Pour the pulp into the pan and heat through for a minute. Pour into a serving dish and leave to cool before serving. Store in a sealed jar and keep in the fridge for up to 2 weeks.",
    "": ""
  },
  {
    "Dish Name": "Quinoa Kosumbari",
    "Description": "Healthy Indian Quinoa Salad",
    "Spice": "mild",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "15 mins",
    "Ingredients": "1) 1 cup Quinoa\n2) 2 cups of water (to cook in)\n3) salt to taste\n4) 1 tsp butter (optional)\n5) half a cucumber\n6) 1 tbsp Sesame oil\n7) ¼ tsp asafetida\n8) 1 tsp mustard seeds\n9) 2 tbsp cashew nuts\n10) 1 green chilli\n11) handful of coconut, grated\n12) handful of coriander, chopped",
    "Instructions": "1) Wash the quinoa in three changes of water to get rid of the bitter coating. Leave it to soak in water for 10 minutes.\n2) Bring the water (2 parts to 1 part Quinoa) to the boil and add the quinoa, salt and a knob of butter to it.\n3) When it starts to boil reduce the heat to a simmer and cook for about 15 minutes.\n4) Peel the cucumber and scoop out the seeds with a spoon - chop into a fine dice and set to one side.\n5) In a small pan heat the oil and add the asafoetida, mustard seeds, cashew nuts and green chillis.\n6) Once toasted (few seconds) pour this into the cooked quinoa and fork it through.\n7) Add the cucumber, grated coconut and lemon juice and mix it all through.\n8) Sprinkle in the fresh chopped coriander and serve.",
    "": ""
  },
  {
    "Dish Name": "Raajma",
    "Description": "Kidney Bean Curry",
    "Spice": "medium",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "40 mins",
    "Ingredients": "1) 200g red kidney beans, soaked overnight\n2) 1 small onion, finley diced\n3) 4 cloves of garlic, finely chopped\n4) 1L water\n5) 200g tinned plum tomatoes (½ tin)\n6) 2 tsp ginger, grated\n7) 1 tsp salt\n8) 1 chilli, roughly chopped\n9) 1 tsp turmeric\n10) 1 tsp garam masala\n11) handful of coriander, chopped",
    "Instructions": "1) Put the soaked red kidney beans and any liquid into the pressure cooker\n2) Add more water to make up about 1L water and add the salt. Put the lid on and bring to the boil (when it whistles) reduce heat and simmer for 30 minutes.\n3) Turn off and leave to cool – DO NOT REMOVE THE LID\n4) In a frying pan heat oil and add the onion and garlic, fry until brown.\n5) Reduce heat and stir in the tomatoes, ginger, chilli, turmeric and cook for about 5-10 minutes to create a thick shiny masala paste.\n6) Ensure the steam has been released from the cooker and open the lid. Check the beans are cooked by squeezing them between your fingers. If they are soft they and squash easily they are ready. If not check the water level (add more if required) place the lid on the pressure cooker again and bring to boil, simmer and leave to cook for a further 10 minutes.\n7) Once the red kidney beans are cooked add the masala paste and stir. Leave on a gentle heat for about 5 minutes.\n8) Add garam masala and chopped coriander to serve.",
    "": ""
  },
  {
    "Dish Name": "Radish and Lemon Salad",
    "Description": "A Healthy and Crunchy Mooli Salad",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "",
    "Ingredients": "1) 10-12 radishes\n2) 1 handful coriander leaves\n3) ½ green chilli\n4) 1 tsp cumin seeds\n5) 2cm piece ginger, grated\n6) 1 lemon\n7) Salt to taste\n8) splash of olive oil (optional)",
    "Instructions": "1) Finely slice the radishes and place them into a bowl\n2) Chop the coriander leaves and chilli and add to the bowl\n3) Toast the cumin seeds in a dry pan until you can smell their aroma then crush the seeds in a pestle and mortar. Sprinkle into the same bowl with the radish.\n4) Grate in the ginger, and squeeze in the lemon juice (and oil if using).\n5) Sprinkle in a little salt and mix everything together.",
    "": ""
  },
  {
    "Dish Name": "Rasam",
    "Description": "South Indian Spiced Soup",
    "Spice": "hot",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "20 mins",
    "Ingredients": "1) 4 cloves garlic\n2) 10cm ginger\n3) 20 curry leaves with stalks\n4) 1 heaped tsp peppercorn\n5) 2 dried red chillies\n6) 1 heaped tsp cumin seeds\n7) 1 tsp turmeric",
    "Instructions": "1) Grind all the ingredients for the paste together in a blender to make a rough paste.",
    "": ""
  },
  {
    "Dish Name": "Red Chilli Sauce",
    "Description": "Habenaro Chilli Sauce",
    "Spice": "hot",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "30 mins",
    "Ingredients": "1) 150g habanero chillies\n2) 50g red birds eye chillies (or for a milder sauce jalapenos)\n3) 1 large onion, sliced\n4) 1 garlic bulb\n5) 1 tsp salt (to taste)\n6) 60ml vinegar",
    "Instructions": "1) Put kitchen gloves on and remove the stalks from the chillies.\n2) Place on an oven tray with the whole bulb of garlic. Heat the oven to 180°C and roast for 15-20 minutes.\n3) Peel the garlic cloves and place into a pan with the chillies.\n4) Add the remaining ingredients to the pan and simmer for 30 minutes. Remove from the heat and leave to cool.\n5) Pour into a liquidiser and blend to a fine puree. If you want the sauce to be a thick sauce then leave it as it is but for a thinner sauce sieve. Store in a sealed jar - this will keep for three weeks in the fridge.",
    "": ""
  },
  {
    "Dish Name": "Red Lentil Dhal",
    "Description": "Masoor di Dhal",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "20 mins",
    "Ingredients": "1) 200g red lentils, washed\n2) 900ml water (approx.)\n3) 1 tsp of salt",
    "Instructions": "1) Place lentils in a pan with the salt, cover with the water and bring to the boil.\n2) Remove the froth, reduce the heat and leave to simmer for 10 minutes. Check the lentils are cooked by squeezing them between your fingers. Once soft remove from the heat.\n3) In a frying pan heat the oil or ghee. Add the dried chilli, bay leaf and the cumin seeds.\n4) When the seeds sizzle, add the onion and garlic and fry until lightly browned. Reduce the heat and add the tomatoes, ginger, turmeric, fenugreek and the chopped chilli. Gently let the ingredients cook down for about 10 minutes to make a thick masala paste.\n5) Add a ladle full of the lentils (dhal) to the masala paste in the frying pan and stir together, then empty all the contents back into the pan with the lentils and stir. It should have the consistency of a thick soup but if it's too thick just add a little boiling water and remove from the heat. If you prefer it thicker just leave it on the heat to reduce until you get the consistency you want.\n6) Check the seasoning and add a little salt if required. Stir in the garam masala and coriander to serve.",
    "": ""
  },
  {
    "Dish Name": "Roasted Red Pepper and Tomato Chutney",
    "Description": "1 hr 10 mins",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "1 hr",
    "Ingredients": "1) 1 large red onion, roughly chopped\n2) 4 cloves of garlic, roughly chopped\n3) 2 red peppers, roughly chopped\n4) 500g of fresh cherry tomatoes\n5) 1 tsp cumin seeds\n6) 2 tbs oil\n7) 1 tbsp of vinegar\n8) 1 tsp salt\n9) 1 green chilli",
    "Instructions": "1) Place the onions, garlic, peppers, and tomatoes into a roasting tin.\n2) Add the oil, vinegar, salt, chilli, cumin and toss well.\n3) Roast at 180ºC for about an hour, or until the peppers are soft, the tomatoes have burst, the onions should be soft and starting to caramelising.\n4) Transfer everything into a blender blend.\n5) Push this through a sieve, store in a jar. It should keep for two weeks in the fridge.",
    "": ""
  },
  {
    "Dish Name": "Roti",
    "Description": "Unleavened Flat Bread",
    "Spice": "",
    "Prep Time": "Prep 30 mins",
    "Cook Time": "5 mins",
    "Ingredients": "1) 500g whole-wheat flour (atta)\n2) 300ml Water approx.\n3) 1 tsp butter or oil",
    "Instructions": "1) Put the atta in a bowl and adding a little water at a time bring the flour together with your hands to make dough.\n2) Start to knead the dough using your knuckles, folding it over as you go. The dough should come together and come away from your hand and the bowl. If it is sticky add a little more flour and continue to knead. The dough needs to be soft but not sloppy. Set to one side for at least half an hour before making the roti.\n3) Put some dry atta on a flat plate for dusting. Heat up the thava on the lowest setting, flour your hands and take a tangerine sized ball of dough.\n4) Roll the dough in the palms of your hands creating a smooth ball.\n5) Flatten it using your fingers then holding the dough in one hand rotate it round and flatten out with the other.\n6) Flour again and begin to roll out. Turn it over, flour and roll again, try not to let it stick. When it is about 7cm in diameter pick it up and pass from one hand the other as if you are clapping.\n7) This evens it out and removes the excess flour.\n8) To cook, heat the tava which is an Indian griddle pan (but a non stick frying pan will do) and carefully place the roti flat on to it. Try not to let the roti fold.\n9) You will see the colour of the roti darken after about 10 seconds, turn the roti over. If using gas - turn the heat down a little and when bubbles appear after about 10 seconds take the thava off the hob and put the roti directly onto the flame.\n10) The roti will begin to puff up, turn it over using tongs and move it around so it doesn't burn. If you are not using a gas cooker or are not comfortable using a naked flame leave the roti on the pan. Turn the heat down a little and when bubbles appear turn the roti over. Using a clean tea towel gently press the top of the roti and it will begin to blow up with hot steam.\n11) Work quickly, turning and pressing until it has all blown up. Be careful not to burn yourself. Remove the roti and set it on a clean tea towel and cover to keep warm.",
    "": ""
  },
  {
    "Dish Name": "Saag Aloo",
    "Description": "Spinach with Potatoes and Indian Spices",
    "Spice": "hot",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "25 mins",
    "Ingredients": "1) 1 tbsp mustard oil\n2) 1 tsp mustard seeds\n3) 1 tsp cumin seeds\n4) Pinch asafoetida\n5) 2 garlic cloves, sliced\n6) 1 tbsp ginger, thinly sliced\n7) 2 tomatoes, chopped\n8) 600g baby spinach, finely sliced\n9) 4 potatoes, peeled & chopped into 3cm cubes (go for floury potatoes such as maris pipers, waxy ones will take longer to cook)\n10) 1 tsp salt or to taste\n11) 1 or 2 chillies, finely sliced\n12) 1 tsp garam masala",
    "Instructions": "1) Heat the oil in a karahi or wok. Add the mustard seeds, and just as they begin to pop, add the cumin seeds and asafoetida.\n2) Add the garlic and ginger and fry for a few minutes on a gentle heat. Then stir in the tomatoes, chilli and salt to taste.\n3) Cook the tomatoes on the same heat until they have turned to a soft pulp. Then add the cubed potatoes and stir them gently to coat them in the sauce. Don't be too heavy-handed as you don't want to mash the cooked potatoes.\n4) Reduce the heat and place a lid on the pan. Cook for about 10 minutes, remembering to stir occasionally. You may need to add a splash of water halfway through to stop the potatoes sticking to the pan and leave to cook.\n5) Once the potatoes have just turned soft (time depends on the potatoes your have used) , add the spinach to the pan and stir gently.\n6) Cook for a further few minutes until the spinach has wilted down. If there is any liquid in the pan at this point, just increase the heat to dry the dish out.\n7) Sprinkle the garam masala over the top before serving.",
    "": ""
  },
  {
    "Dish Name": "Saag Paneer",
    "Description": "Puréed Spinach with Paneer",
    "Spice": "medium",
    "Prep Time": "Prep 20 mins",
    "Cook Time": "30 mins",
    "Ingredients": "1) 1 tbsp butter / 2 tbsp vegetable oil\n2) 750g baby spinach, washed\n3) 1-2 green chillies, roughly chopped",
    "Instructions": "1) Heat the butter or oil in a pan and add the washed spinach. Sauté until the leaves just wilt.\n2) Once cooled add one or two roughly chopped chillies to the pan and using a hand blender blitz the cooked spinach and chillies in to a smooth paste - set to one side.",
    "": ""
  },
  {
    "Dish Name": "Saag Walee Roti",
    "Description": "Unleavened Spinach Flatbread",
    "Spice": "none",
    "Prep Time": "Prep 25 mins",
    "Cook Time": "5 mins",
    "Ingredients": "1) 260g chakki atta or atta flour (half wholemeal and half plain works as well)\n2) ½ tsp salt\n3) 2 tsp oil\n4) 50g big handful of spinach\n5) 100ml warm milk",
    "Instructions": "1) Heat water in a pan and add spinach. Blanch and remove the spinach, and then rinse under cold water.\n2) Place in a blender and add the milk. Blitz to a puree and set to one side.\n3) Mix flour, salt and oil together. Pour in the spinach and milk puree a little at a time and knead to a soft dough. Cover with a tea towel and set to one side for 20 minutes.",
    "": ""
  },
  {
    "Dish Name": "Saffron Potatoes",
    "Description": "Kesar wala Aloo",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "15 mins",
    "Ingredients": "1) 4 large potatoes\n2) 1 tbsp oil\n3) 290ml boiling water\n4) pinch of saffron strands\n5) salt to taste\n6) 1 tsp garam masala\n7) 1 tsp chilli flakes",
    "Instructions": "1) Pour boiling water into a jug and add the saffron.\n2) Wash and scrub potatoes then cut into chunky wedges with the skin left on.\n3) In a large non-stick frying pan or oven tray heat the vegetable oil. Once hot add the wedges and saute then until they are starting to brown (about five minutes).\n4) Add the salt, pepper, garam masala to coat the potatoes.\n5) Then add the chilli flakes and pour in the saffron water.\n6) Simmer this on a rapid heat for about six or seven minutes.\n7) Reduce the heat and leave the potatoes to cook gently for about 15 minutes until the potatoes are soft and most of the water has evapourated.",
    "": ""
  },
  {
    "Dish Name": "Salt and Chilli Almonds",
    "Description": "Spiced Roasted Almonds",
    "Spice": "medium",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "15 mins",
    "Ingredients": "1) 500g almonds\n2) 1 tsp salt\n3) 1 tbsp hot water\n4) 2 tbsp olive oil\n5) 1 tsp chilli powder\n6) 1 tsp garlic granules\n7) Sea salt to taste\n8) 1 tsp chilli flakes (optional)",
    "Instructions": "1) Heat oven to 190°C degrees and line a large baking sheet with silicone or grease proof paper.\n2) Place the raw almonds in a large mixing bowl\n3) Stir 1 teaspoon of salt into the hot water until most of it dissolves and pour over the nuts in the bowl and mix until they are all coated.\n4) Place the almonds onto the prepared baking sheet in a single layer and bake in the oven for about 8 minutes, stir well and spread back into a single layer and bake another 7-8 minutes (about 15 minutes total). Keep an eye on them as they can burn quickly.\n5) Mix the olive oil with the chilli powder and garlic granules.\n6) Place the hot nuts back into the large bowl and pour the olive oil over them. Toss well until all the nuts are coated.\n7) Sprinkle on a little sea salt and chilli flakes and mix through.\n8) Spread the nuts out on the baking sheet to cool and crisp up. They will soak up the oil as they cool.\n9) Store in an airtight container at room temperature and enjoy as a snack.",
    "": ""
  },
  {
    "Dish Name": "Salted Lassi",
    "Description": "Salted Yoghurt Drink",
    "Spice": "none",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "",
    "Ingredients": "1) 500ml Greek yoghurt\n2) 250ml water\n3) 1 tsp black salt\n4) 1 tsp roasted cumin seeds\n5) mint leaves to garnish\n6) ice cubes",
    "Instructions": "1) Put the yoghurt into a tall jug and add the cold water.\n2) Roast the cumin seeds in a pan and grind to a powder in a pestle and mortar.\n3) Add half the salt and the roasted cumin powder to the yoghurt mixture.\n4) Blend everything together with a whisk until it is smooth. Check the seasoning and add a little more salt if required.\n5) Put the ice cubes into the glasses and pour the lassi in. add a couple of mint leaves to the lassi.",
    "": ""
  },
  {
    "Dish Name": "Sarson Ka Saag",
    "Description": "Puréed Mustard Greens",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "20 mins",
    "Ingredients": "1) 500g palak/spinach\n2) 500g saag mustard leaves if you can find them if not use curly kale or greens (washed and dried thoroughly)\n3) 4cm ginger, roughly chopped\n4) 5 cloves garlic, whole\n5) 1 chilli, roughly chopped\n6) 1 tsp salt\n7) 1-2 tbsp corn flour to thicken (if required)\n8) 4 tomatoes, finely chopped\n9) 65g butter",
    "Instructions": "1) Wash and slice the spinach and place in the bottom of the pressure cooker.\n2) Wash and finely slice the greens and place on top of the spinach.\n3) Add the ginger, garlic, salt and chilli to the pan and secure the pan lid.\n4) Heat the pressure cooker and bring to temperature. When the cooker whistles twice (should take about 10 minutes) reduce the heat and leave to simmer for about 5 minutes.\n5) Remove from the heat and leave to cool - DO NOT REMOVE THE LID.\n6) Next release the pressure, open the lid and leave to cool for a few minutes.\n7) Using your hand blender blitz the saag. The aim is to have a thick bright green puree, if it's a little watery place the cooker back on the stove on a high heat and stir continuously to reduce and thicken. You can also thicken it up by sprinkling with a little corn flour, but I prefer not to.\n8) In a frying pan melt the butter and add the chopped tomatoes. Fry gently until the tomatoes have cooked down to a pulp and you have a thick tomato paste.\n9) Stir into the saag, check seasoning and serve.",
    "": ""
  },
  {
    "Dish Name": "Saunth ki Chutney",
    "Description": "Tamarind and Ginger Chutney",
    "Spice": "medium",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "10 mins",
    "Ingredients": "1) 100g tamarind\n2) 150g jaggery grated\n3) 1 tsp Salt\n4) 1 tsp kala namak (pink salt), optional\n5) 1 tsp garam Masala\n6) ½ tsp ginger powder\n7) ½ tsp black pepper\n8) ½ tsp chilli powder",
    "Instructions": "1) If using tamarind in the block form - cover the tamarind in boiling water, leave it to soak for about 10-20minutes.\n2) Using a fork mash it well and then strain, save the tamarind water and discard the stones and pulp. (You can repeat this process to get more tamarind water). The tamarind water should be pouring consistency.\n3) Pour the tamarind water (or paste) into a pan, add the rest of the ingredients and bring to a boil. Leave to simmer for a few minutes until it thickens to a sauce consistency.\n4) Cool and serve.",
    "": ""
  },
  {
    "Dish Name": "Seekh Kebabs",
    "Description": "Skewered Kebabs",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "15 mins",
    "Ingredients": "1) 500g lamb mince\n2) 4 garlic cloves\n3) 10cm piece of ginger, roughly chopped\n4) 1 chilli, chopped\n5) 1 tsp cumin seeds\n6) 1 tsp garam masala\n7) 1 tsp Kashmiri chilli powder\n8) 1 tsp salt\n9) handful of coriander (including stems)\n10) 1 tbsp oil\n11) wooden or metal skewers",
    "Instructions": "1) In a pestle and mortar roughly crush the cumin seeds, ginger, chilli and garlic then put into a blender.\n2) Then add the mince, garam masala, Kashmiri chilli powder, salt and coriander. Blend to paste and leave to rest in the refridgerator (or freezer) for 15 mins.\n3) If using wooden skewers, soak in cold water for at least 30 minutes.\n4) Coat your hands in a little oil and take a small ball (size of a walnut) of the lamb mixture and squeeze around the skewer. Set to one side and repeat with the remaining mixture. Refridgerate for at least 30 mins before cooking\n5) Cook in a frying pan or griddle for 10 minutes then turn to cook the other side until brown and a little crispy. These are also delicious on the barbecue.\n6) Serve with a fresh mint chutney.",
    "": ""
  },
  {
    "Dish Name": "Sholay",
    "Description": "Chickpea Curry",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "50 mins",
    "Ingredients": "1) 100g dried chickpeas soaked overnight in 1L of water\n2) 1 onion, finely diced\n3) 4 cloves of garlic, finely chopped\n4) 400g/1 tin of tomatoes\n5) 2 tsp ginger grated\n6) 1 tsp salt\n7) 1 green chilli, chopped\n8) 1 tsp turmeric\n9) 1 tsp chilli powder\n10) 1 tsp dried fenugreek leaves\n11) 1 tsp garam masala\n12) 1 handful of coriander, chopped\n13) 1 lemon\n14) 1 or 2 green chillies, chopped to garnish\n15) sliced red onion to garnish",
    "Instructions": "1) In the pressure cooker heat oil and add onions and garlic. Fry until golden brown, and if the onions stick just add a dash of water and stir until they have browned.\n2) Reduce the heat and add tomatoes, ginger, chilli, salt, turmeric and fenugreek. Cook this sauce until the onions and tomatoes melt together and you are left with an aromatic masala paste.\n3) Wash the soaked chickpeas and add to the pan, then stir fry for a few minutes.\n4) Add enough hot water to cover the chickpeas and put the lid on the pressure cooker. Bring it to the boil and leave it until it whistles twice, then reduce the heat and let it simmer for 10 minutes.\n5) Remove from heat and leave to cool. DO NOT REMOVE LID. Once cooled remove the lid and check the chickpeas are cooked. If they are still hard, check the water and if you need to add a little more then and put the lid on again and repeat step 4.\n6) Once cooked through place the pan on the heat and stir-fry the chickpeas to reduce and thicken the sauce.\n7) Turn the heat off and squeeze in the juice from 1 lemon and stir in the garam masala.\n8) To garnish sprinkle over the fresh coriander, the finely sliced onions and green chillies.",
    "": ""
  },
  {
    "Dish Name": "Sindhi Masala Fish",
    "Description": "Dry fried spiced fish",
    "Spice": "medium",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "10 mins",
    "Ingredients": "1) 1 tbsp coriander seeds\n2) 2 tsp fennel seeds\n3) 2 garlic cloves\n4) 2 tbsp plain flour\n5) 1 tbsp turmeric powder\n6) 1 tsp chilli powder\n7) 2 tsp garam masala\n8) 1 tsp salt\n9) 4 large white fish fillets, plaice, haddock or cobbler are good\n10) Rapeseed oil to fry",
    "Instructions": "1) Crush the coriander seeds, fennel seeds and garlic cloves in a pestle and mortar then empty into a bowl.\n2) Mix in the flour, turmeric, chilli powder, garam masala and salt.\n3) Place the fish fillets into the masala mix and coated them then set to one side.\n4) In a large deep frying pan, add enough vegetable oil so it's about 5cm deep to fry the fish.\n5) Gently heat the oil and test whether it’s ready by dropping a small bit of the masala mixture into the oil, if it fizzes and turns brown in a few seconds the oil is ready.\n6) Very gently slip in a couple of fish fillets and cook for around 4–5 minutes, gently turning them over until cooked through and they have turned a wonderful yellow colour.\n7) Drain on some kitchen paper.",
    "": ""
  },
  {
    "Dish Name": "Smoked Bangun Partha",
    "Description": "Aubergine Pate",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "35 mins",
    "Ingredients": "1) 2 aubergines\n2) 2 tbsp of mustard oil\n3) 2 onions, sliced\n4) 1 heaped tsp cumin seeds\n5) 4cm stick of cassia bark\n6) 1 tsp of salt\n7) 1 tsp of cinnamon powder\n8) 2 green chillies, finely chopped\n9) ½ tsp turmeric\n10) 3 fresh tomatoes, cut into wedges\n11) Handful of fresh coriander, chopped",
    "Instructions": "1) Place one aubergine at a time directly onto the flame of your hob turning them with tongs to blacken and blister the outside. Alternatively, cook in a wood burning stove or barbecue to get a wonderful smoky flavour.\n2) Once blackened place on a tray and roast in a pre-heated oven at 180oC) for about 10 minutes. Turn and then leave for a further 10 minutes. They should be soft and cooked through.\n3) Leave to cool then either peel the skin away or slice in half and scoop out the flesh discarding the skin. Mash the flesh to a pulp and set to one side.\n4) Heat the oil in a pan and add the cumin seed and cassia bark.\n5) Once sizzling add the sliced onion and cook until golden brown.\n6) Add the chillies, turmeric, salt, cinnamon powder and stir in the aubergine flesh. Leave to cook for 20 minutes until you have a thick spicy masala pate.\n7) Add the tomatoes and cook for another few minutes then remove from the heat.\n8) Add a handful of fresh coriander before serving. I sometimes also like to add a splash of coconut milk to make it nice and creamy.",
    "": ""
  },
  {
    "Dish Name": "Smoked Tomato Sauce",
    "Description": "A healthy tomato relish with seriously deep flavours.",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "1 hr",
    "Ingredients": "1) 5 cloves of garlic, peeled and finely chopped\n2) 1 tsp kalonji seeds\n3) 1 tsp salt\n4) 2 dried red chillies\n5) 1 green chilli, chopped\n6) 10 tomatoes\n7) lump of smoking charcoal",
    "Instructions": "1) Heat oil in a pan and add the garlic.\n2) Fry until it starts to brown.\n3) Add the kalonji seeds, salt and chillies.\n4) Stir then add the tomatoes, bring to the boil then reduce the heat and leave to cook gently for about 30 minutes to an hour until thick.\n5) Leave to cool and place into a dish. To infuse the smoky flavour make a foil bowl and place in the centre of the chutney. Carefully heat a piece of charcoal until it's smoking then place it in the foil cup. Cover the whole dish with foil and set aside for half an hour to allow the smoky flavours to infuse into the chutney.",
    "": ""
  },
  {
    "Dish Name": "Sooke Moong Dhal",
    "Description": "Moong Dhal",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "10 mins",
    "Ingredients": "1) 200g whole moong dhal / mung beans\n2) 1 tbsp oil\n3) ¼ tsp mustard seeds\n4) ¼ tsp cumin seeds\n5) ¼ tsp asafoetida\n6) ¼ tsp turmeric\n7) 1 tsp chilli powder\n8) 1 tsp coriander seeds, crushed\n9) 2 tsp lemon juice\n10) 1 tsp salt\n11) Pinch of sugar (optional)\n12) Fresh coriander, chopped",
    "Instructions": "1) Soak the moong dhal for about 15 minutes.\n2) Put the soaked moong dhal and 350ml water into your pressure cooker.\n3) Place the lid on and cook at high pressure for 10 minutes then turn off and leave for the pressure to be released.\n4) In a pan heat oil add mustard seeds, cumin and asafoetida until they sizzle.\n5) Pour in the moong dhal and add the turmeric, chilli powder, coriander, lemon juice, sugar (if using) and salt.\n6) Stir together and garnish with fresh coriander. Mix and serve hot.",
    "": ""
  },
  {
    "Dish Name": "Soya curry",
    "Description": "Soya chunks with peas and pepper",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "20 mins",
    "Ingredients": "1) 1 tbsp vegetable oil\n2) 1 onion, finely chopped\n3) 3 garlic cloves, chopped\n4) 3cm piece of ginger, grated\n5) 250g tinned plum tomatoes\n6) 1 green chilli, finely chopped\n7) 1 tsp salt\n8) 1 tsp fenugreek powder (methi)\n9) 1 tsp turmeric\n10) 1 tsp chilli powder\n11) 200g peas\n12) 200g dried soya chunks\n13) 1 red pepper, sliced\n14) 1 tsp garam masala\n15) Handful of fresh coriander (chopped)",
    "Instructions": "1) Soak the soya chunks in boiling water for 10-20 minutes until they are soft.\n2) Heat oil in a pan and add onion and after a few minutes stir in the garlic. Cook for about 10 minutes until the onions are soft and just turning golden.\n3) When the onions are cooked add the tomatoes, ginger, salt, turmeric, fenugreek and chilli.\n4) Stir together and cook the sauce until the tomatoes and onion melt together creating a thick masala paste.\n5) Squeeze the water out of the soya (be mindful that the water may still be hot).\n6) Once the masala is thick and shiny add the soya and frozen peas. Stir and cook for 5 minuets.\n7) Add the peppers and cook for 5-6 minutes. If you want to create a little sauce add some hot water to get the consistency of the sauce that you are looking for.\n8) Sprinkle in the garam masala and fresh coriander to serve.",
    "": ""
  },
  {
    "Dish Name": "Spiced Cauliflower Rice",
    "Description": "Cauliflower Rice",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "10 mins",
    "Ingredients": "1) 1 medium cauliflower, shredded\n2) 1 tbsp rapeseed oil\n3) 1 tsp black mustard seeds\n4) 1 tsp cumin seeds\n5) 2 dried Kashmiri chillies, each broken into 3 or 4 pieces\n6) 5cm piece ginger, finely grated\n7) 1 garlic clove, sliced\n8) ½ tsp turmeric\n9) 1 tsp salt\n10) 2 fresh green chillies, sliced",
    "Instructions": "1) Roughly chop your cauliflower, put into a blender and blitz very quickly to get a fine shred of cauliflower.\n2) Heat the oil in a large saucepan or karahi. When it is hot, add the mustard seeds followed by the cumin seeds and dried chillies.\n3) Stir for about 30 seconds, then add the sliced garlic, grated ginger, turmeric and salt and fry for 30 seconds.\n4) Stir in the cauli rice and stir-fry for about 3-4 minutes over a medium heat. Stir in the green chillies.",
    "": ""
  },
  {
    "Dish Name": "Spiced Fish Pie",
    "Description": "Indian Fish Pie",
    "Spice": "mild",
    "Prep Time": "Prep 15 mins",
    "Cook Time": "40 mins",
    "Ingredients": "1) 2 tbsp oil\n2) 1 tsp fennel seeds\n3) ½ tsp mustard seeds\n4) 1 onion, chopped\n5) 2 garlic cloves, finely chopped\n6) 1 large handful of fresh spinach, chopped\n7) 1 chilli, chopped\n8) 400ml cream\n9) 400g firm white fish\n10) 200g salmon\n11) 100g smoked fish\n12) 300g prawns\n13) salt and pepper to taste",
    "Instructions": "1) Heat oven to 200°C.\n2) Heat the oil and temper the fennel and mustard seeds until they crackle. Add the  chopped onion and cook for 5 minutes.\n3) Stir in the garlic and cook through allowing the onions to soften and turn translucent.\n4) Add the chopped spinach and chilli and once the spinach has wilted pour in the cream and stir. Season with the salt and pepper.\n5) As the cream warms up place the fish and prawns into the pan and simmer gently for a few minutes until it's just cooked through.\n6) Remove from heat and place in a casserole dish.",
    "": ""
  },
  {
    "Dish Name": "Spiced Jerusalem Artichokes",
    "Description": "Artichoke Masala",
    "Spice": "medium",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "10 mins",
    "Ingredients": "1) 500g Jerusalem artichokes\n2) 2 tbsp vegetable oil\n3) 1 heaped tsp cumin seeds\n4) large pinch of asafoetida\n5) 1 green chilli, chopped\n6) ½ tsp salt\n7) 1 lemon\n8) 1 tsp garam masala\n9) Handful of fresh coriander",
    "Instructions": "1) Wash and scrub the artichokes, then peel and chop them into 4cm cubes.\n2) Heat oil in a wok or karahi, add cumin seeds and asafoetida powder.\n3) Once the seeds crackle, add the chillies and salt and add the chopped artichokes.\n4) Stir and coat them with the spices and leave them to cook on a gentle heat for about 5-10 minutes, stirring occasionally. Cook them to the texture you like — I like mine with a crunch. Remove from the heat.\n5) Squeeze in a little fresh lemon juice, sprinkle the garam masala and transfer to a bowl.\n6) Sprinkle with the fresh coriander to finish.",
    "": ""
  },
  {
    "Dish Name": "Spiced Potato Stuffed Peppers",
    "Description": "Shimla Mirch Stuffed with Spiced Potato",
    "Spice": "medium",
    "Prep Time": "Prep 20 mins",
    "Cook Time": "50 mins",
    "Ingredients": "1) 4 whole peppers, 2 red and 2 green\n2) 4 medium sized potatoes, boiled and diced\n3) 1 tsp rapeseed oil\n4) 1 tsp of salt\n5) 1 tsp cumin seeds\n6) 1 green chilli, finely chopped\n7) 1 tsp garam masala\n8) 3cm fresh ginger, grated\n9) 1 tbsp fenugreek leaves\n10) 1 tbsp fresh coriander, finely chopped",
    "Instructions": "1) Cook the potatoes gently with the skin on (do not boil too vigorously) for 20-25 minutes. Once soft leave to cool and then peel. Cut into small cubes and place into a large bowl.\n2) In a small frying pan heat the oil and fry the cumin seeds. When sizzling and aromatic remove and add to the potatoes.\n3) Next add the salt, chilli, garam masala, fenugreek, ginger and fresh coriander to the potatoes and stir - check seasoning.",
    "": ""
  },
  {
    "Dish Name": "Spiced Pumpkin Seeds",
    "Description": "Roasted Pumpkin Seeds",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "20 mins",
    "Ingredients": "1) Seeds from one pumpkin\n2) 1 tsp salt\n3) 1 tsp chilli flakes\n4) 1-2 tsp rapeseed oil",
    "Instructions": "1) Pull out the seeds from the pumpkin and place into a bowl with water.\n2) Wash the seeds in a few changes of water to get rid of all the stringy flesh.\n3) Place in a colander and leave to strain.\n4) Place some kitchen roll on a baking sheet and put the seeds on it so they dry. You can leave them overnight.\n5) Heat your oven to 180ºC\n6) Spread the seeds on an oven tray and pour the oil over the seeds. Rub them so they are coated with the oil. Sprinkle with the salt and chilli flakes.\n7) Roast in the oven for 10 minutes until they are golden brown.\n8) Remove and leave to cool. Store in an air tight jar and use as and when required.",
    "": ""
  },
  {
    "Dish Name": "Spiced Rice",
    "Description": "Basmati Rice with Whole Spices",
    "Spice": "none",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "15 mins",
    "Ingredients": "1) 1 tbsp ghee\n2) 1 tsp cumin seeds\n3) 1 stick of cassia bark\n4) 3 cloves\n5) 4 cardamom pods\n6) 2 star anise\n7) 1 small onion, finely sliced\n8) 1 garlic clove, sliced\n9) 4cm piece of ginger, julienne\n10) 10/15 cashew nuts\n11) 1 tbsp raisins, (optional)\n12) 200g/1 mug Basmati rice\n13) 500ml/2 mugs full, cold water\n14) 1 tsp salt, (or to taste)",
    "Instructions": "1) Wash the rice until the water runs clear. I do this by covering the rice with water and running my hand through it, pouring the starchy water away then refilling with cold water and repeating until the water runs clear. Strain in a sieve and leave.\n2) In a wide based pan heat the ghee and add the whole spices - cumin seeds,cassia, cloves, cardamom, star anise.\n3) When they sizzle and become fragrant stir in the onions and saute.\n4) After a minute or 2 add the garlic. Just as you get a little colour add the ginger, cashews and raisins.\n5) Add the washed rice, stir to coat with the spices then pour in the 500ml of water (twice the amount of water to rice).\n6) Add the salt and bring the water to a vigorous rolling boil, reduce the heat to the lowest setting and place the lid on the pan.\n7) Leave to cook for 10 minutes do not remove the lid - be patient!\n8) After 10 minutes remove from the heat and leave for a minute.\n9) Then take the lid off and let the steam rise. All the water will have been absorbed and the rice will be light and fluffy.\n10) Gently fork through the rice (never dive straight in) and serve.",
    "": ""
  },
  {
    "Dish Name": "Spicy Courgette and Pea Fritter",
    "Description": "20 mins",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "10 mins",
    "Ingredients": "1) 2 medium courgettes, grated\n2) 100g plain flour (or gram flour)\n3) 1 tsp baking powder\n4) 1 small onion, finely chopped\n5) 50g frozen peas, defrosted\n6) 2 cloves of garlic, finely chopped\n7) salt to taste\n8) 1 green chilli, chopped\n9) handful coriander, chopped\n10) 1 tsp chilli powder\n11) 1 tsp garam masala\n12) 1 tsp cumin seeds\n13) oil for cooking",
    "Instructions": "1) Grate the courgette and sprinkle with salt and leave for as long as you can. Place it in a colander in the sink, squeezing out any excess water.\n2) In a bowl mix together the flour and baking soda.\n3) Add the grated courgette, onion, peas, garlic, salt, chilli, coriander, chilli powder, garam masala and cumin seeds.\n4) Squeeze and mix everything together. If it's a little dry add a touch of water.\n5) Heat some oil (2 tbsp) in a nonstick frying pan.\n6) Take a large spoonful and place in the hot pan. Gently press to flatten (it will be sticky) and shallow fry fritters. Reduce the heat if it gets too hot.\n7) Cook on the first side until golden then flip and cook the other side.",
    "": ""
  },
  {
    "Dish Name": "Spicy Lamb Chops",
    "Description": "1 hr 25 mins",
    "Spice": "hot",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "15 mins",
    "Ingredients": "1) 4 lamb chops\n2) 1 tbsp coriander seeds\n3) 1 tsp fennel seeds\n4) 1 tsp cumin seeds\n5) 5 dried Kashmiri chillies (or chilli powder mixed with paprika)\n6) 4 cloves garlic, peeled and roughly chopped\n7) 2 tbsp ginger, grated\n8) 1 tsp salt\n9) 1 tbsp rapeseed oil\n10) 1 lemon",
    "Instructions": "1) In a pestle and mortar crush the coriander, cumin, fennel seeds and dried chillies.\n2) Then add the garlic, ginger and salt then grind with the spices to create a thick paste.\n3) Pour in the oil and lemon juice and mix together.\n4) Smear the paste all over the chops and leave to marinate for at least 1 hour.\n5) Ensure they are at room temperature and cook on a griddle or barbecue for 4-5 minutes on each side until cooked through.",
    "": ""
  },
  {
    "Dish Name": "Spinach and Mushroom Omelette",
    "Description": "10 mins",
    "Spice": "medium",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "5 mins",
    "Ingredients": "1) 1 tbsp oil\n2) 1 spring onion, chopped\n3) 1 tsp cumin seeds\n4) 1 green chilli, chopped (optional)\n5) salt to taste\n6) 4 mushrooms, sliced\n7) handful spinach\n8) 1 tsp garam masala\n9) 2 eggs",
    "Instructions": "1) Heat the oil in a pan then add the cumin seeds.\n2) Once they sizzle add the chopped spring onions and sauté.\n3) Stir in the chopped chillies (if using) and a little salt.\n4) Add the mushrooms and stir, cook for about 4-5 minutes.\n5) Add the spinach and stir until it has wilted. Sprinkle in the garam masala then remove the pan from the heat and set to one side.\n6) In two bowls separate the yolk and the egg whites.\n7) Whisk the egg whites until frothy then whisk in the egg yolks.\n8) Heat a little butter in a frying pan and add the eggs. Leave to cook for about 30 seconds then turn the omelette over.\n9) Place the cooked omelette onto a plate and spoon the filling into the omelette and fold over to serve.",
    "": ""
  },
  {
    "Dish Name": "Sweet Potato and Spinach Curry",
    "Description": "Sweet Potato and Spinach Curry",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "20 mins",
    "Ingredients": "1) 1 tbsp rapeseed oil\n2) 1 tsp cumin seeds\n3) 1 tsp black mustard seeds\n4) 2 red onions, thinly sliced\n5) 2 large cloves of garlic, finely chopped\n6) 1 tsp ginger, grated\n7) 2 green chillies,, thinly sliced\n8) 1 tsp coriander seeds\n9) 1 tsp turmeric salt to taste\n10) 1-2 sweet potatoes, diced (about 700g)\n11) 300g spinach, coarsely chopped\n12) 1 tsp garam masala\n13) 1 tbsp flaked almonds, toasted",
    "Instructions": "1) Heat the oil in a large saucepan and add the cumin seeds, once fragrant add the mustard seeds. As they start to pop add the onion.\n2) Stir and cook until it's translucent then add the garlic.\n3) After a few minutes stir in the ginger, and chilli. You may need to add a splash of water too.\n4) Grind the coriander seeds to a powder in a pestle and mortar.\n5) Place the ground coriander and turmeric in a bowl and add a little water to produce a spice paste.\n6) Once the onions have browned, pour in the spices paste and heat until fragrant.\n7) Add some salt then reduce the heat then add the sweet potato cubes. Stir to coat with the spices.\n8) Leave to cook gently for about 25-30 minutes, keep checking but do not stir too much. If you need to, you can add a little splash of water.\n9) Once the sweet potatoes are soft add the spinach and stir together.\n10) In a frying pan add some flaked almonds and toast for 1-2 minutes until a little brown and crisp. Remove from the pan and set to one side.\n11) Once the spinach has wilted taste and adjust seasoning if required. Remove from the heat and stir in some garam masala. Top with the flaked almonds to serve.",
    "": ""
  },
  {
    "Dish Name": "Tamarind Rice",
    "Description": "Imlee Chaul",
    "Spice": "medium",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "15 mins",
    "Ingredients": "1) 200g Tilda Basmati Rice, cooked\n2) 25g tamarind hydrated in 100ml water or 1 tbsp tamarind paste mixed with 4 tbsp water\n3) 2 tbsp coconut oil\n4) 1 tsp mustard seeds\n5) ½ tbsp urid dhal\n6) 1 tbsp chana dhal\n7) ½ tsp fenugreek seeds\n8) 2 dried red chillies, broken\n9) 5 curry leaves\n10) 1 onion, chopped or ½ tsp asafoetida/asafetida\n11) 1 tbsp peanuts\n12) ½ tsp turmeric\n13) 1 tsp salt or to taste\n14) Handful of fresh coriander",
    "Instructions": "1) Have your cooked rice ready and make up your tamarind water and set to one side.\n2) Heat the oil in a pan and add the mustard seeds as they begin to pop stir in the urid and chana dhal. The dhal will begin to toast.\n3) When they change colour add the fenugreek seeds, dried red chillies then stir in the curry leaves .\n4) Add the onions (if using) and cook until they are a lovely golden brown colour or add the asafoetida and stir.\n5) Add the peanuts to toast for a few minutes and sprinkle in the turmeric.\n6) Pour in the tamarind. If using tamarind water leave it to cook until it has thickened (about 5 minutes).\n7) Add salt to taste and stir in the cooked rice to coat and heat through.\n8) Remove from the heat and sprinkle in some fresh coriander to serve.",
    "": ""
  },
  {
    "Dish Name": "Tandoori Chicken",
    "Description": "Chicken in a Spiced Yoghurt",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "40 mins",
    "Ingredients": "1) 4 chicken legs, skinned and trimmed",
    "Instructions": "1) Once skinned and trimmed, slash the flesh on the legs twice, diagonally, down to the bone.\n2) Blend the garlic, ginger, chilli in a pestle and mortar.\n3) Place the chicken in a dish and stir in the blended ingredients. Pour on the lemon juice and the mustard oil.\n4) In a separate dish, mix the remaining ingredients (salt, garam masala, ground cumin seeds, Kashmiri red chilli powder, dried fenugreek leaves) with the yoghurt to create a paste. Add this yoghurt paste to the chicken and massage into the meat using your hands.\n5) Cover, refrigerate and leave for at least 30 minutes, but the longer the better. Heat the oven to 200oC.\n6) Transfer the marinated chicken to an oven tray and cook for about 30-40 minutes. The chicken should be tender and a little charred, which helps give the smokey flavour. Even better, you can cook this on the barbecue!",
    "": ""
  },
  {
    "Dish Name": "Tandoori Fish",
    "Description": "Fish in a spiced yoghurt marinade",
    "Spice": "medium",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "10 mins",
    "Ingredients": "1) 500g Salmon or monkfish, in thick chunks\n2) 1 lemon\n3) salt to taste\n4) 1 tsp cumin seeds\n5) 3 garlic cloves, roughly chopped\n6) 4cm piece of ginger, roughly chopped\n7) 1 green chilli, chopped\n8) 1 heaped tbsp thick greek yoghurt\n9) 1 tsp kashmiri chilli powder or paprika\n10) 1 tsp garam masala\n11) 1 heaped tsp chickpea flour\n12) 1 tbsp fresh coriander finely chopped\n13) 1 tsp vegetable oil\n14) Lemon juice to garnish\n15) Handful of fresh coriander, chopped",
    "Instructions": "1) Add the salmon to a mixing bowl along with juice from half the lemon juice and salt and mix well\n2) Give the cumin seeds a bash and add to the bowl.\n3) Crush the ginger and garlic in a pestle and mortar and place into a bowl.\n4) Add the finely chopped chilli, and the remaining marinade ingredients and mix to ensure the fish is all coated. Leave to marinate for half an hour. The fish can be skewered or cooked directly on a baking sheet.\n5) Preheat the grill to a medium to high setting. Grill for 15 mins until it's just done (you can also bake this in the oven if too)\n6) Once cooked squeeze over a little lemon juice and sprinkle with green coriander and serve.",
    "": ""
  },
  {
    "Dish Name": "Tandoori Prawn Skewers",
    "Description": "Tandoori Jinga",
    "Spice": "medium",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "5 mins",
    "Ingredients": "1) 12 large uncooked king prawns\n2) 1 fresh chilli, finely\n3) ½ tsp chilli powder\n4) 3 garlic cloves\n5) 3cm ginger\n6) 1 tsp salt\n7) 1 lemon, juice",
    "Instructions": "1) Crush the ginger and garlic in a pestle and mortar to make a paste.\n2) Place the prawns in a large bowl and sprinkle with the chilli powder, salt, lemon juice and the crushed ginger and garlic and set to one side.\n3) Blend all the marinade ingredients together and coat the prawns, refrigerate for however long you can or just cook them.\n4) Thread the marinated prawns onto skewers and cook on a griddle or on a barbecue for 5-6 minutes until they are pink and just cooked through.\n5) Squeeze with lemon juice and some fresh coriander to serve.",
    "": ""
  },
  {
    "Dish Name": "Tandoori Style Pigeon Breast",
    "Description": "35 mins",
    "Spice": "mild",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "10 mins",
    "Ingredients": "1) 8 pigeon breasts",
    "Instructions": "1) Blend the ginger, garlic to make a paste.\n2) Mix the ginger and garlic paste with lemon juice, salt, chilli powder and coat the pigeon breasts. Leave them to marinate for about 20 minutes.",
    "": ""
  },
  {
    "Dish Name": "Tangy Tamarind Prawns",
    "Description": "1 hr",
    "Spice": "hot",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "40 mins",
    "Ingredients": "1) 500g fresh king prawns\n2) 2 tbsp oil\n3) 1 tsp cumin seeds\n4) 1 onion, finely sliced\n5) 2 cloves of garlic, finely chopped\n6) 200g tinned tomatoes (½ tin)\n7) 1 tbsp ginger, grated\n8) 1 tsp turmeric\n9) 1 tsp salt\n10) 1 chilli, finely chopped\n11) 1 tbsp tamarind paste (alternatively a good squeeze of lemon juice)",
    "Instructions": "1) Heat the oil in a pan. Add the cumin seeds, when sizzling add the onion and garlic. Fry gently until golden brown.\n2) Once browned, reduce the heat and add the tinned tomatoes, ginger, turmeric, salt, chilli and tamarind paste. Increase the heat and stir so the tomatoes and onions melt together creating a thick masala sauce.\n3) Once the sauce is shiny, add the prawns and stir to coat them with the sauce. Reduce the heat and cook through for a few minutes.\n4) Add in the fresh tomatoes, stir and cook for a minute then remove from the heat.\n5) Stir in the garam masala and throw in the coriander to add a beautiful freshness to the dish and serve.",
    "": ""
  },
  {
    "Dish Name": "Thai Prawn Tom Khaa Soup",
    "Description": "Tom Yum Soup with coconut milk",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "10 mins",
    "Ingredients": "1) 1 tbsp vegetable oil\n2) 10 prawns, peeled and deveined\n3) 2 garlic cloves, finely grated\n4) 2 tsp ginger, finely grated\n5) 1 lemongrass, peeled and finely grated\n6) 1 tbsp brown sugar\n7) 1 1/2 tbsp fish sauce\n8) 1 tsp coriander powder\n9) 2 tsp chilli, garlic paste\n10) 400g coconut milk tin\n11) 500ml chicken stock\n12) zest from 1 lime\n13) 200g egg noodles,\n14) 2 pak choy, quartered or Chinese lettuce",
    "Instructions": "1) Heat oil in a large saucepan over high heat. Add prawns and sear both sides until light golden (30 seconds). Remove and set to one side.\n2) Reduce the heat and add a little more oil. Add garlic, ginger and lemongrass. Saute until golden.\n3) Add sugar and fish sauce. Stir and cook for 30 seconds until it turns almost to a caramel.\n4) Add chilli paste, coriander powder and stir to cook for 30 seconds.\n5) Pour in the chicken stock with the coconut milk and bring to a simmer.\n6) Add the lime zest and stir in the noodles. Simmer to cook them as per the packet - usually about 5 minutes.\n7) Add the pak choi for a minute then add the prawns into broth. Cook for 1 minutes to reheat them and serve in big bowls.\n8) Add toppings of your choice and squeeze over lime juice to taste.",
    "": ""
  },
  {
    "Dish Name": "Thari Walee Lamb",
    "Description": "Lamb Curry",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "1 hr",
    "Ingredients": "1) 600g leg of lamb (washed, trimmed & cubed)",
    "Instructions": "1) Heat the oil in a heavy based pan and add the onions, after a few minutes stir in the chopped garlic.\n2) Cook on a gentle heat so the onions cook to a dark golden brown. This will take at least 20 minutes. If the onions catch on the pan add a splash of water and stir.\n3) Reduce the heat and add the tomatoes, ginger, salt, cumin, turmeric, chilli, coriander stalks and fenugreek. Stir together and increase the heat so the onions and tomatoes melt with the spices creating a thick aromatic masala sauce. This will take about 5-10 minutes.\n4) Add the lamb and stir-fry to seal the meat and coat with the masala sauce.\n5) Reduce the heat to the lowest setting and move the pan to the smallest hob. Place the lid on the pan and allow the lamb to cook gently in it own juices. This will take between 40-60 minutes. Stir occasionally until tender.\n6) If you want more of a gravy add some boiling water and leave to simmer for another few minutes.\n7) Remove from the heat and add the garam masala, sprinkle with the fresh coriander and serve.",
    "": ""
  },
  {
    "Dish Name": "Tomato Base Restaurant Sauce",
    "Description": "Tomato Masala",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "1 hr 5 mins",
    "Ingredients": "1) 500g onions, peeled\n2) 25g fresh root ginger\n3) 900ml water\n4) 25g garlic\n5) 1 tbsp salt\n6) 400g tin of tomatoes\n7) 4 tbsp of vegetable oil\n8) 1 tbsp tomato purée\n9) 1 tbsp turmeric\n10) 1 tsp mild chilli powder/paprika",
    "Instructions": "1) Roughly chop the onion, ginger and garlic.\n2) In a blender blitz the onions, ginger and garlic with half the water until you have a smooth paste.\n3) Place this blended paste and the remaining water into a large pan. Stir in the salt and bring to boil, ten reduce the heat and leave to simmer for about 45 minutes. Leave to cool.\n4) Once cooled, pour into a blender and whizz until you are left with a completely smooth sauce.\n5) Blend the tinned tomatoes until completely smooth.\n6) Heat the oil in a clean pan and add the tomato purée, turmeric and chilli powder. Stir in the blended tomatoes and bring it all to the boil.\n7) Reduce the heat and leave to simmer for 10 minutes. Stir in the onion mix and bring it all to a boil. After a few minutes reduce to a simmer.\n8) Skim off any froth from the top and leave to cook for 25 minutes continuing skimming off any froth.\n9) Leave to cool and store in the refrigerator for 5 days, or freeze\n10) Heat and use as and when required.",
    "": ""
  },
  {
    "Dish Name": "Tomato Kachumber Salad",
    "Description": "Tomato and Onion Salad",
    "Spice": "medium",
    "Prep Time": "Prep 20 mins",
    "Cook Time": "",
    "Ingredients": "1) 1 small red onion\n2) 2 tomatoes\n3) 1 chilli, finely chopped\n4) Fresh coriander leaves\n5) Juice from 1 lemon\n6) 1 tsp salt\n7) ½ tsp garam masala\n8) 1 tsp kalonji seeds",
    "Instructions": "1) Cut the onions, tomato, chilli into a very fine dice and place into a bowl.\n2) Finely chop the coriander and place into the bowl.\n3) Squeeze in the lemon and sprinkle in the salt, garam masala, kalonji seeds - stir and serve.",
    "": ""
  },
  {
    "Dish Name": "Turnip Chana Dhal",
    "Description": "Shalgam Chana",
    "Spice": "mild",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "40 mins",
    "Ingredients": "1) 4 small turnips\n2) 125g Chana Dal\n3) 1 small onion, sliced\n4) 2 cloves of garlic, sliced\n5) 3 ripe tomatoes\n6) 1 or 2 green chillies\n7) 4cm piece of ginger\n8) 1 tbsp oil\n9) 1 tsp cumin seeds\n10) 4 cm piece cassia bark\n11) 1 tsp mustard seeds\n12) 1 tsp coriander seeds\n13) ½ tsp red chilli powder\n14) ½ turmeric powder\n15) 1tsp or to taste salt\n16) handful fresh coriander, chopped",
    "Instructions": "1) Clean the chana dal and soak it in water for 3-4 hours before hand.\n2) Peel, wash and cut turnips into small pieces.\n3) Put the soaked dal and turnip pieces into a prerssure cooker, add 2 cups water, salt and then close the cooker and begin to heat.\n4) After the first whistle reduce the heat and leave it to simmer about 4 minutes, then remove from the heat. Leave to cook and DO NOT open until the pressure has been releases.\n5) Meanwhile roughly chop the tomatoes and chillies and ginger.\n6) Place the cumin, mustard and coriander seeds in a frying pan and roast until they turn a shade darker and become frgrant. Crush the spices in a pestle and mortar or a spice grinder.\n7) Then put the tomatoes, green chillies, ginger into a blender to make a fine paste.\n8) Heat oil in a frying pan and add the cumin and cassia. Once fragrant add the sliced onions and garlic until they just start to brown.\n9) Stir in the turmeric powder, salt and ground spices once this becomes fragrant stir in the tomato mixture and leave to cook until you have a thick masala sauce.\n10) Open the cooker, and check the dhal is well cooked by squeezing the chana between your fingers. If they are cooked stir in the masala sauce into the dhal.\n11) If you want to loosen it a little add enough hot water to get the consistency you want.\n12) Add the chopped coriander and garnish with a little butter.",
    "": ""
  },
  {
    "Dish Name": "Vegan Wild Rice, Cumin & Chickpea Burgers",
    "Description": "Channa Chaul Tikki",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "15 mins",
    "Ingredients": "1) 200g cooked and cooled wild rice\n2) 200g tinned chickpeas, drained\n3) 2 shallots, minced\n4) 1 tsp cumin seeds\n5) 2 clove garlic, minced\n6) 6 mushrooms, finely chopped\n7) 1 green chilli chopped (optional)\n8) 1 large fresh tomato, diced\n9) 1 tsp salt\n10) 1/2 tsp turmeric\n11) 1/2 tsp chilli powder\n12) 35g Panko breadcrumbs\n13) 2 tbsp chopped fresh coriander\n14) ½ tsp Kashmiri chilli powder\n15) 2 tbsp rapeseed oil for frying",
    "Instructions": "1) Cook the rice as per the instructions on the pack.\n2) Heat the a frying pan over medium heat. Once hot, add oil and cumin seeds.\n3) Once fragrant add the shallots and cook until translucent then add the garlic and cook for a minute. Add the mushrooms, chopped green chilli and tomatoes.\n4) Season with salt, turmeric and chilli powder, and saute until you have a dry paste.\n5) Add the drained chickpeas, cooked rice, to coat and remove from heat and set aside.\n6) Put the cooled mixture, fresh coriander, panko breadcrumbs into a bowl and mix thoroughly with your hand. Squash the chickpeas until you have a pliable mixture – it should come together.\n7) Form the mixture into four 1/2-inch thick patties – you need to press them together very firmly and place in the fridge so they set.\n8) Heat oil in a large frying pan over medium-high heat. Add patties and cook until golden brown, about 4 minutes per side.\n9) Toast some wholemeal pitta breads and serve the burgers in the pitta with salad and some Spiced tomato chutney.",
    "": ""
  },
  {
    "Dish Name": "Vegetable Pilau",
    "Description": "Mixed Vegetable Rice",
    "Spice": "medium",
    "Prep Time": "Prep 10 mins",
    "Cook Time": "20 mins",
    "Ingredients": "1) 50g peas\n2) 1 carrot (diced small)\n3) 100g mixed vegetables - mushrooms, cauliflower, sweetcorn etc",
    "Instructions": "1) Wash the rice until water runs clear and set to one side.\n2) In a small bowl add the saffron strands and pour in a splash milk. Leave the saffron to steep.\n3) Heat the oil and add the bay leaves, cassia bark, peppercorns, cumin seeds, cardamoms, black cardamom, cloves and stir-fry for 2 minutes until the spices become aromatic.\n4) Add chopped onions and cook until soft. Stir in the salt and cook until the onion just begin to turn golden then stir in the ginger, garlic, green chilli, mint and coriander leaves.\n5) Add the mixed vegetables. Stir to coat and cook for a few minutes.\n6) Add the washed rice and stir through very gently. Add the water and bring to the boil.\n7) Reduce the heat to the lowest setting and place the lid on the pan and leave to cook for 10 minutes. Splash the saffron milk on the rice and leave the lid on the pan for a few more minutes.\n8) Remove the lid and fork through the rice and serve.",
    "": ""
  },
  {
    "Dish Name": "Watermelon and Feta Chaat",
    "Description": "Indian Style Watermelon and Feta Salad",
    "Spice": "medium",
    "Prep Time": "Prep 40 mins",
    "Cook Time": "15 mins",
    "Ingredients": "1) 250g atta\n2) salt pinch\n3) 1 tsp ajwain\n4) ½ tsp baking powder\n5) 3 tbsp rapeseed oil or ghee\n6) 1/4 cup water",
    "Instructions": "1) Add the flour to a bowl and mix in the salt and carom seeds.\n2) Add the oil and start to knead to form a dough pour in the water a little at a time until you have a soft dough. If it's sticky add a little more flour. Let it rest for 15 mins. Knead a little more to soften.\n3) Heat oven 200°c\n4) Take a ball and roll out to make a roti about 2-3mm thickness.\n5) With a fork make holes all over the surface of the rolled out roti.\n6) Using a cookie cutter cut out round discs and place onto a baking sheet lined with parchment paper.\n7) Bake in the oven for 8-10 minutes, turning half way just until they turn golden (keep an eye on them).\n8) Remove from the oven and leave to cool until crisp.",
    "": ""
  },
  {
    "Dish Name": "Zambezi Baked Sea Bream",
    "Description": "Shama with relish",
    "Spice": "medium",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "20 mins",
    "Ingredients": "1) 2 whole sea bream (sea bass fillets if you prefer)\n2) 1 onion, sliced\n3) 1 green pepper, chopped\n4) 1 tomato, chopped\n5) 3 garlic cloves\n6) 2cm piece of ginger\n7) 1 red chilli\n8) ½ tsp salt\n9) Half a lemon\n10) Fresh coriander (optional)\n11) ½ tsp chilli flakes",
    "Instructions": "1) Heat your oven to 180ºC\n2) Remove any scales, clean and wash the fish. With a sharp knife make 3 or 4 slits on the outside of the fish on both sides. Set to one side.\n3) In a pestle and mortar crush the coriander seeds, cumin seeds, black peppercorns and place into a bowl.\n4) Chop the curry leaves and add to the bowl with the turmeric, chilli powder and methi. Stir in the oil to make a paste.\n5) Slice the ginger, garlic and chillies.\n6) Chop the peppers and tomato, slice the onion and mix with the ginger, garlic and chillies.\n7) Smear some of the spice mix inside the fish and then stuff it with the onion mixture. Smear the remaining fish masala all over the outside of the fish.\n8) Place the fish onto some foil and fold it to seal neatly.\n9) Place of a baking sheet and cook for 20-30 minutes until cooked through. This can also be cooked on the BBQ for a smoky flavour.\n10) Once cooked, remove from the oven and open up the parcel with will be aromatic and delicious. You can put this under a hot grill for a few minutes to crispy up if you want to.\n11) Serve with some cooked rice, a squeeze of lemon juice and a sprinkle of coriander. I also like to add a few chilli flakes.",
    "": ""
  },
  {
    "Dish Name": "Zhoug",
    "Description": "Middle Eastern Coriander Dip",
    "Spice": "medium",
    "Prep Time": "Prep 5 mins",
    "Cook Time": "5 mins",
    "Ingredients": "1) 4 cloves garlic, roughly chopped\n2) 2 bunches of fresh coriander, leaves and stems (unless very hard)2-3 green chillies\n3) 1 tsp sea salt\n4) 4 whole green cardamom\n5) 1 tsp cumin seeds\n6) ½-1 tsp red chilli flakes\n7) 150ml oilve oil or rapeseed oil\n8) 1 lemon, juice of",
    "Instructions": "1) Toast the cardamom and cumin until fragrant in a dry pan.\n2) Place in a spice grind and blitz to a powder.\n3) Add the garlic cloves, coriander leaves, chillies, salt and red pepper flakes and blend agin.\n4) Pour in the oil until it's smooth (you may need to scrape the sides down).\n5) The flavour of this dip transforms and changes over time so let it relax in the fridge. This will keep for 7-8 days in the fridge.",
    "": ""
  }
]